<schedule><conference><title>Capitole du Libre 2019</title><venue>ENSEEIHT, 2 rue Charles Camichel, Toulouse</venue><city>Toulouse</city><start_date>2019-11-16</start_date><end_date>2019-11-17</end_date><days_count>2</days_count></conference><day date="2019-11-16" index="1"><room name="A001" /><event id="807"><persons /><person id="651">Genma</person><tags /><start>10:30</start><duration>00:30</duration><room>A001</room><slug>nextcloud-de-lusage-personnel-sur-yunohost-a-un-us</slug><title>Nextcloud - De l'usage personnel sur Yunohost &#224; un usage professionnel chez Atos</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Facile &#224; installer, facile &#224; g&#233;rer, pourquoi ne pas h&#233;berger votre propre Nextcloud sur YunoHost (Yunohost est un syst&#232;me d'exploitation serveur destin&#233; &#224; rendre l'auto-h&#233;bergement accessible au plus grand nombre, sans nuire &#224; la qualit&#233; et &#224; la fiabilit&#233; du logiciel). Mais Nextcloud, ce n'est pas que pour les particuliers. Au sein du centre OpenSource d'Atos, je travaille au d&#233;veloppement d&#8217;une offre et d&#8217;un partenariat autour de Nextcloud &amp; Collabora pour nos clients. Petite pr&#233;sentation d'en quoi Nextcloud, c'est la solution cloud qui peut r&#233;pondre aux besoins professionnel en alternative &#224; Office365 ou GoogleDocs.</description><links /></event><event id="833"><persons /><person id="662">Emmanuelle HELLY / Numahell</person><tags /><start>11:00</start><duration>00:30</duration><room>A001</room><slug>gerer-et-valoriser-les-randonnees-et-les-activites</slug><title>G&#233;rer et valoriser les randonn&#233;es et les activit&#233;s touristiques avec Geotrek</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Geotrek est une suite logicielle pour la gestion et la valorisation des randonn&#233;es (application m&#233;tier, site web, application mobile), utilis&#233;e par de nombreux parcs naturels et collectivit&#233;s territoriales. &#201;dit&#233;e par Makina Corpus, chaque brique est un logiciel libre, l'ensemble permet de g&#233;rer et valoriser les randonn&#233;es et les activit&#233;s touristiques d'un territoire.

Toutes les infos sur http://geotrek.fr/</description><links /></event><event id="830"><persons /><person id="696">Olivier GIORGIS</person><tags /><start>11:30</start><duration>00:30</duration><room>A001</room><slug>jupyter-et-jupyterlab-training-au-service-de-la-fo</slug><title>Jupyter et jupyterlab-training au service de la formation</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Jupyter est une application web utilis&#233;e pour programmer dans plus de 40 langages de programmation, dont Python, Julia, Ruby ou encore R. Jupyter est une &#233;volution du projet IPython.

JupyterLab s'appuie sur l&#8217;architecture de Jupyter et propose une interface utilisateur repens&#233;e et d&#233;coup&#233;e en composants.

JupyterLab Training est un logiciel libre bas&#233; sur JupyterLab d&#233;velopp&#233; et utilis&#233; par Logilab pour la formation (notamment Python et Python scientifique).

Il permet la mise &#224; disposition aux stagiaires du contenu (cours, exercices, logiciels tiers) ainsi que d'un environnement de d&#233;velopement. Plus besoin de mettre &#224; disposition une salle de formation avec 
des logiciels adapt&#233;s et parfois complexes &#224; installer, un simple navigateur web suffit pour participer &#224; la formation. Un plugin permet de faire des exercises en utilisant les bonnes pratiques des tests unitaires.

Technos en logiciel libre : 
* JupyterLab, 
* JupyterHub,
* Docker,  
* Kubernetes, 
* Python, 
* TypeScript, 
* React</description><links /></event><event id="835"><persons /><person id="698">Cedric RAVALEC</person><tags /><start>12:00</start><duration>00:30</duration><room>A001</room><slug>open-hardware-un-monde-meconnu-en-pleine-evolution</slug><title>Open Hardware : Un monde m&#233;connu en pleine &#233;volution</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Cela fait des ann&#233;es que nous entendons parler de l'Open Hardware mais pour la plupart des gens en dehors des boards de d&#233;veloppement comme Arduino, cela reste une utopie voir un domaine d&#8217;exp&#233;rimentation. 
Depuis maintenant 3 ans ce domaine de l'Open Source est en pleine croissance avec des initiatives comme :

 - L'architecture du jeu d'instructions RISC libre et ouvert Risc-V
 - L'Open Firmware alliance  avec coreboot
 - Les solution pour h&#233;bergeur avec Open Compute Project</description><links /></event><event id="693"><persons /><person id="562">St&#233;phane BORTZMEYER</person><tags /><start>15:00</start><duration>01:00</duration><room>A001</room><slug>le-protocole-quic-ou-la-nouvelle-couche-de-transpo</slug><title>Le protocole QUIC, ou la nouvelle couche de transport</title><subtitle /><track>Technique</track><type>conference</type><language /><description>QUIC, d&#233;sormais largement d&#233;ploy&#233;, et depuis peu normalis&#233; [enfin, si le RFC est publi&#233; d'ici novembre, c'est pas gagn&#233;], est un concurrent de TCP. 

TCP &#233;tait auparavant *le* protocole de transport de l'Internet, &#224; part quelques cas particuliers. QUIC est un concurrent, suppos&#233; diminuer la latence, notamment pour les requ&#234;tes HTTP. (HTTP/3 est juste HTTP-sur-QUIC.)

QUIC n'est pas juste un changement technique, il a suscit&#233; beaucoup de d&#233;bats politiques, ce sera donc l'occasion de parler de sujets comme l'ossification de l'Internet, la possibilit&#233; de d&#233;ployer des nouveaut&#233;s rapidement, le pouvoir des &#233;diteurs de navigateurs, le d&#233;sir de dissimuler au r&#233;seau ce qu'on lui exposait avant, cf. RFC 8546, la r&#233;duction des protocoles applicatifs &#224; HTTP, etc.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2019/le-protocole-quic-ou-la-nouvelle-couche-de-transpo/capitole-libre-2019-protocole-quic.pdf</link></links></event><event id="770"><persons /><person id="641">Alexandre LISSY</person><tags /><start>16:30</start><duration>01:00</duration><room>A001</room><slug>reconnaissance-vocale-libre-et-locale</slug><title>Reconnaissance vocale libre et locale</title><subtitle /><track>Technique</track><type>conference</type><language /><description>La voix est une interface en pleine essor, et pour le moment principalement contr&#244;l&#233;e par les acteurs majeurs du web. Ces derniers promeuvent des mod&#232;les centralis&#233;s pour assurer la captation de donn&#233;es utilisateur. Cette pr&#233;sentation introduit les deux projets Common Voice et DeepSpeech qui visent &#224; lib&#233;rer l'acc&#232;s &#224; la voix pour les d&#233;veloppeurs et les utilisateurs.

Common Voice propose de collecter des donn&#233;es vocales qui seront accessibles sous licence CC-0 pour casser les barri&#232;res qui limitent l'acc&#232;s aux technologies vocales. C'est un projet qui est accessible au grand public ; sa participation est primordiale pour avoir une vari&#233;t&#233;s de voix garantissant une bonne repr&#233;sentativit&#233;.

DeepSpeech est un projet d'une impl&#233;mentation de syst&#232;me de reconnaissance et de synth&#232;se vocale sous licence libre, et qui vise &#224; proposer une qualit&#233; de production fonctionnant correctement totalement en local. C'est un projet qui est plus orient&#233; d&#233;veloppeurs, mais les enjeux de vie priv&#233;e int&#233;ressent tout le monde.

Les 50 minutes peuvent &#234;tre d&#233;coup&#233;es en 20 minutes accessibles au grand public (Common Voice) et 15 minutes plus pour les d&#233;veloppeurs (DeepSpeech), suivies de 15 minutes de Q&amp;A.</description><links /></event><event id="786"><persons /><person id="651">Genma</person><tags /><start>17:30</start><duration>01:00</duration><room>A001</room><slug>un-mode-kiosk-avec-ubuntu-en-2019-cest-possible</slug><title>Un mode Kiosk avec Ubuntu en 2019, c'est possible !</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Le Centre d'action sociale de la Ville de Paris (CASVP) propose de nombreuses prestations cr&#233;&#233;es par la Ville de Paris pour ses habitants. En octobre 2019, des bornes libres services sont mises &#224; disposition pour faciliter les d&#233;marches num&#233;riques aux b&#233;n&#233;ficiaires. Le syst&#232;me informatique de ces bornes a &#233;t&#233; r&#233;alis&#233; par Atos ; l'ensemble du projet - documentation compl&#232;te des hacks et scripts r&#233;alis&#233;s permettant une r&#233;utilisation - sera lib&#233;r&#233; &#224; la mi-novembre 2019 &#224; la suite du Capitole du libre sous licence Creative Commons. 

La conf&#233;rence a pour objectifs de pr&#233;senter le projet, son interface, et de r&#233;pondre &#224; la question : quel int&#233;r&#234;t peuvent avoir des collectivit&#233;s, des m&#233;diath&#232;ques, des &#233;coles &#224; s'int&#233;resser et surtout s'approprier et contribuer &#224; ce projet ? Mais surtout, de pr&#233;senter, comment du point de vue technique en 2019, sur base Ubuntu, il est possible de faire une borne mode Kiosk avec un Firefox mais pas que... et de r&#233;pondre au cahier des charges et aux demandes de :
- simplifier et verrouiller Firefox pour avoir un mode kiosk en 2019 (tous les tutoriels sur le sujet &#233;tant obsol&#232;tes....) ;
- simplifier Ubuntu et Gnome 3 pour verouiller les possibilit&#233;s d'interactions pour rendre l'usage le plus simple possible ;
- cr&#233;er une session utilisateur temporaire / jetable et pourtant r&#233;utilisable et &#233;volutive  ;
- pouvoir maintenir la solution et la faire &#233;voluer.</description><links /></event><room name="A002" /><event id="725"><persons /><person id="602">Jean-Philippe MENGUAL</person><tags /><start>10:30</start><duration>01:00</duration><room>A002</room><slug>qui-a-dit-que-debian-etait-reserve-aux-serveurs</slug><title>Qui a dit que Debian &#233;tait r&#233;serv&#233; aux serveurs</title><subtitle /><track>Technique</track><type>conference</type><language /><description>"Debian, c'est pour les administrateurs syst&#232;me". Mais alors pourquoi je l'utilise? Pire, pourquoi Hypra la propose &#224; des personne &#226;g&#233;es n'ayant jamais touch&#233; un ordi? Parce qu'on est fou?

Cette conf&#233;rence vise &#224; pr&#233;senter quelques grandes caract&#233;ristiques qui font de Debian une distribution tout autant grand public que pour initi&#233;s. Mais surtout, elle va rompre avec la tradition dans sa pr&#233;senttion d'une ditribution. En sortant, vous aurez m&#234;me l'impression que contribuer est &#224; votre port&#233;e! Car oui, on peut faire carri&#232;re (b&#233;n&#233;vole) chez Debian, quel que soit son niveau. Mais comme tout distributeur, il a une organisation. Voyons-la ensemble!

Si on comparait Debian distribution &#224; un magasin de la grande distribution? Mais avec des valeurs, du service, de l'&#233;thique, de la d&#233;mocratie et du non profit? Bref, m&#234;me logistique, mais plus humaine en somme! Vous croyez que &#231;a ne tient pas? Venez, vous serez &#233;tonn&#233; comme moi en y pensant.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2019/qui-a-dit-que-debian-etait-reserve-aux-serveurs/Qui_a_dit_que_Debian_%C3%A9tait_r%C3%A9se_iNF29ru.pdf</link></links></event><event id="812"><persons /><person id="680">Mathieu CINQUIN</person><person id="681">David SABATI&#201;</person><tags /><start>11:30</start><duration>00:30</duration><room>A002</room><slug>1001-facons-dinstaller-prometheus</slug><title>1001 fa&#231;ons d&#8217;installer Prometheus...</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Prometheus est l'outil qui actuellement fait l'unanimit&#233; dans le domaine supervision. On le voit beaucoup utiliser avec Kubernetes mais il peut aussi s'int&#233;grer dans une architecture "classique". Pour r&#233;pondre &#224; ces diff&#233;rents besoins, il devra &#234;tre install&#233; de mani&#232;re diff&#233;rente afin de b&#233;n&#233;ficier au maximum de toutes ses fonctionnalit&#233;s.
Ce talk balaiera de mani&#232;re synth&#233;tique toutes les possibilit&#233; d'installation de Prometheus.</description><links /></event><event id="846"><persons /><person id="710">S&#233;bastien DINOT</person><tags /><start>12:00</start><duration>00:30</duration><room>A002</room><slug>plateforme-dintegration-continue-elastique-avec-gi</slug><title>Plateforme d&#8217;int&#233;gration continue &#233;lastique avec Gitlab CI</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Orfeo Toolbox est un ensemble de biblioth&#232;ques et d&#8217;outils libres de traitement d&#8217;images pour la t&#233;l&#233;d&#233;tection. La compilation, l&#8217;ex&#233;cution de sa lourde batterie de tests unitaires et le contr&#244;le qualit&#233; de cet outil multiplatefome et supportant diverses configurations, n&#233;cessitent d&#8217;importantes ressources mat&#233;rielles. La plateforme d&#8217;int&#233;gration continue de ce projet doit &#234;tre dimensionn&#233;e en cons&#233;quence pour fournir un retour rapide aux d&#233;veloppeurs. Mais le cout d&#8217;une telle plateforme est important.

Pour fournir au projet les moyens dont il avait besoin en optimisant le cout de l&#8217;infrastructure, nous avons &#233;labor&#233; une plateforme d&#8217;int&#233;gration continue &#233;lastique (i.e. dimensionn&#233;e dynamiquement), dans laquelle les machines virtuelles ex&#233;cutant les t&#226;ches du pipeline sont cr&#233;&#233;es &#224; la demande dans un cloud et d&#233;truites ensuite. Sa conception a &#233;t&#233; largement complexifi&#233;e par le fait qu'elle est publique et ouverte, donc tr&#232;s expos&#233;e aux abus et autres d&#233;tournements. Il a fallu les anticiper et leur trouver une parade.

Cette conf&#233;rence vous pr&#233;sentera cette plateforme bas&#233;e sur Gitlab, Gitlab CI, Gitlab Runner, Docker, Docker Machine, OpenStack, CDash et SonarQube.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2019/plateforme-dintegration-continue-elastique-avec-gi/pic_otb_cdl_20191116.pdf</link></links></event><event id="903"><persons /><person id="772">Michael Opdenacker</person><tags /><start>15:00</start><duration>01:00</duration><room>A002</room><slug>linux-embarque-from-scratch-en-40-minutes-sur-risc</slug><title>Linux embarqu&#233; "from scratch" en 40 minutes, sur RiscV !</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Michael vous propose une version remise &#224; neuf d'une ancienne pr&#233;sentation
qu'il avait faite il y a 15 ans pour faire d&#233;couvrir Linux embarqu&#233;,
et qui avait longtemps &#233;t&#233; une de ses pr&#233;sentations les plus t&#233;l&#233;charg&#233;es.

Venez donc d&#233;couvrir comment construire &#224; partir de z&#233;ro votre propre
syst&#232;me Linux embarqu&#233;. Vous compilerez votre noyau cette fois pour l'architecture ouverte et libre RiscV, que vous d&#233;marrerez sur un syst&#232;me &#233;mul&#233; par QEMU. Vous construirez aussi vous-m&#234;me un syst&#232;me de fichiers minimal gr&#226;ce au projet BusyBox. Vous finirez par piloter le syst&#232;me via un tout petit serveur web.

L'approche sera de ne mettre que les fichiers qui seront strictement n&#233;cessaires. C'est aussi l&#224; tout l'int&#233;r&#234;t de Linux embarqu&#233;: on peut vraiment tout ma&#238;triser et tout comprendre qui tourne sur son syst&#232;me, et voir &#224; quel point le syst&#232;me peut-&#234;tre simple. C'est beaucoup plus simple que d'essayer de comprendre comment fonctionne un syst&#232;me GNU/Linux &#224; partir d'une distribution aussi &#233;labor&#233;e que Debian !

Vous repartirez bien-s&#251;r avec tout le mat&#233;riel (!) et le code n&#233;cessaire pour tout refaire chez vous et rajouter vos propres am&#233;liorations.</description><links /></event><event id="837"><persons /><person id="704">Antoine BEYET</person><tags /><start>16:30</start><duration>01:00</duration><room>A002</room><slug>quel-reverse-proxy-pour-mes-containers</slug><title>Quel reverse proxy pour mes containers ?</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>L'arriv&#233;e des containers, et le dynamisme qu'ils introduisent ont chang&#233;s les op&#233;rations web. Les reverses proxys, point d'entr&#233;e sur ces services contain&#233;ris&#233;s, ont du s'adapter &#224; ces nouveaux challenges.

Au programme, une pr&#233;sentation des fonctionnalit&#233;s attendues d'un reverse-proxy pour une plateforme comme Kubernetes, un retour sur les diff&#233;rentes options existantes, pourquoi nous avons choisi Envoy et ce qu'il nous permet de faire en production.</description><links /></event><event id="892"><persons /><person id="747">Adrien Blind</person><person id="770">Ludovic Piot</person><person id="771">Laurent Grangeau</person><tags /><start>17:30</start><duration>01:00</duration><room>A002</room><slug>conference-en-cours-de-definition</slug><title>Cloud : 3 sc&#233;narios multi-providers, du portage IaaS, au serverless en abstraction totale</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>2018 fut l'ann&#233;e de l'adoption massive du Cloud, pour de la production r&#233;elle. L'&#233;tape suivante, c'est de passer au cloud multi-providers. Mais cette strat&#233;gie multi-providers pr&#233;sente des enjeux d'architecture et d'impl&#233;mentation techniques particuliers.

Cette session vous accompagne dans la d&#233;couverte de 3 mini sc&#233;narios :
1. le portage d'une plateforme construite sur du IaaS vers une solution &#233;quivalente mais multi-providers. Pour ne pas &#234;tre prisonnier d'un seul fournisseur. Comment faire &#233;voluer la codebase d'Infra as Code Terraform pour maintenir et op&#233;rer cette solution ?
2. La d&#233;couverte de Pulumi, une solution d&#8217;infra-as-code innovante, r&#233;volutionnant certains paradigmes d&#8217;architecture : et si le code applicatif, et celui permettant de piloter l&#8217;infra ne faisaient en fait qu&#8217;un ?
3. La construction d'une application h&#233;berg&#233;e en serverless o&#249; l'on veut &#234;tre agnostique de l'infrastructure bien s&#251;r, mais aussi du service FaaS utilis&#233;. Voire utiliser diff&#233;rents services FaaS.</description><links /></event><room name="A201" /><event id="734"><persons /><person id="610">Julien CABIECES</person><tags /><start>11:00</start><duration>00:30</duration><room>A201</room><slug>comment-contribuer-a-un-logiciel-libre-exemple-du-</slug><title>Comment contribuer &#224; un logiciel libre. Exemple du projet QGIS</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Certains logiciels libres atteignent une taille cons&#233;quente et n&#233;cessitent un volume de contribution toujours croissant, le recrutement de nouveaux contributeurs repr&#233;sente donc un enjeu important.

Cette conf&#233;rence se propose de pr&#233;senter les diff&#233;rents moyens permettant de contribuer &#224; un projet OpenSource. Du d&#233;veloppement &#224; la documentation en passant par l'&#233;vang&#233;lisation en dehors des cercles d'initi&#233;s, cette pr&#233;sentation tentera de tordre le cou &#224; l'id&#233;e re&#231;ue que seuls les d&#233;veloppeurs peuvent participer &#224; un projet open source.

La pr&#233;sentation tentera ensuite de r&#233;pondre &#224; la question du financement de cette contribution, les difficult&#233;es rencontr&#233;es et les solutions possibles.

Le projet QGIS, logiciel SIG (syst&#232;me d'information g&#233;ographique) libre et multiplateforme, servira de support &#224; la pr&#233;sentation pour illustrer de fa&#231;on pratique les diff&#233;rentes probl&#233;matiques.</description><links /></event><event id="876"><persons /><person id="745">Geoffrey LE GOURRIEREC</person><tags /><start>11:30</start><duration>01:00</duration><room>A201</room><slug>atelier-de-creation-numerique</slug><title>Zephyr : un OS temps r&#233;el open source pour l'IoT</title><subtitle /><track /><type>conference</type><language /><description>Zephyr : un OS temps r&#233;el open source pour l'IoT

Zephyr est un RTOS open-source r&#233;cent, d&#233;velopp&#233; et maintenu par une organisation sous la coupole de la Linux Foundation. On y trouve notamment Intel, Nordic Semiconductor, Linaro, mais aussi pl&#233;thore de contributeurs occasionnels, comme pour tout projet ouvert.

De m&#234;me calibre que ses voisins Contiki, MyNewt ou FreeRTOS, il est con&#231;u pour tourner sur des microcontr&#244;leurs aux ressources limit&#233;es: application, kernel et pile r&#233;seau tiennent sur &lt; 50 Ko. Il tente de se d&#233;marquer de la concurrence par quelques choix de conception: un design unikernel, et une r&#233;flexion sur la s&#233;curit&#233; en amont (groupe de travail d&#233;di&#233;, fuzzing, pentesting...).

Le but de la pr&#233;sentation est de faire un tour de l'architecture de Zephyr, la fa&#231;on dont la communaut&#233; fonctionne, et la vision technique qui s'en d&#233;gage. On appuiera les propos par une petite d&#233;mo simple: configurer le kernel, choisir une application simple et compiler le tout dans une image unique, qu'on flashera sur un device.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2019/atelier-de-creation-numerique/zephyr_eng_6lUwmBD.pdf</link></links></event><event id="717"><persons /><person id="588">Denis DORDOIGNE</person><tags /><start>15:00</start><duration>01:00</duration><room>A201</room><slug>90-facons-de-collaborer-au-libre-sans-taper-une-se</slug><title>90 fa&#231;ons de collaborer au libre sans taper une seule ligne de code</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>Alors que chacun peut b&#233;n&#233;ficier aujourd'hui des projets libres, on croit souvent qu'y contribuer est r&#233;serv&#233; aux seules personnes ayant des comp&#233;tences en d&#233;veloppement de logiciel. Cependant, il existe des centaines de fa&#231;ons de contribuer au libre en utilisant d'autres comp&#233;tences, et m&#234;me en n'ayant aucune comp&#233;tence particuli&#232;re. En sortant de cette conf&#233;rence, vous saurez comment rejoindre le cercle tr&#232;s ouvert des contributrices et contributeurs du libre.</description><links /></event><event id="861"><persons /><person id="720">Ludovic DUBOST</person><tags /><start>16:30</start><duration>01:00</duration><room>A201</room><slug>comment-financer-un-projet-de-logiciel-libre</slug><title>Comment financer un projet de logiciel libre</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>D&#233;velopper ou participer &#224; un logiciel dans son temps libre ou dans une grande entreprise est un chose, mais est-il possible de devenir un d&#233;veloppeur de logiciel libre ind&#233;pendant &#224; plein temps ?

L'objectif de cette conf&#233;rence est de partager les m&#233;thodes qui ont permis de financer les logiciels libres XWiki et CryptPad dans le cadre d'une petite PME (XWiki SAS), avec des approches diverses allant du financement par les services aux entreprises, mais aussi au cloud et au donations.</description><links /></event><event id="845"><persons /><person id="710">S&#233;bastien DINOT</person><tags /><start>17:30</start><duration>00:30</duration><room>A201</room><slug>communaute-et-gouvernance-les-facteurs-cles-de-la-</slug><title>Communaut&#233; et Gouvernance : les facteurs cl&#233;s de la r&#233;ussite d&#8217;un projet libre</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>La gouvernance et la communaut&#233; d&#8217;un logiciel libre sont tout aussi importantes que la qualit&#233; technique et la licence de ce logiciel libre. En effet, le succ&#232;s d&#8217;un logiciel libre se mesure &#224; la taille et &#224; la vitalit&#233; de sa communaut&#233;, non &#224; la qualit&#233; de son code source. L&#8217;exp&#233;rience montre que cette communaut&#233; ne peut naitre et se d&#233;velopper que si les porteurs du projet font preuve &#224; son &#233;gard d&#8217;une constante attention et veillent &#224; cr&#233;er un climat de confiance dont la pierre angulaire est la gouvernance du projet.

Apr&#232;s un rapide survol des facteurs techniques et juridiques, nous nous pencherons plus longuement sur les facteurs sociaux de la r&#233;ussite d&#8217;un projet libre. Pour terminer, nous verrons comment ceux-ci s&#8217;appliquent au projet Orekit qui connait un succ&#232;s international aupr&#232;s des acteurs de l&#8217;industrie et de la recherche spatiales.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2019/communaute-et-gouvernance-les-facteurs-cles-de-la-/gouv_et_com_cdl_20191116.pdf</link></links></event><event id="832"><persons /><person id="698">Cedric RAVALEC</person><tags /><start>18:00</start><duration>00:30</duration><room>A201</room><slug>trouver-un-equilibre-entre-les-makers-et-les-taker</slug><title>Trouver un &#233;quilibre entre les Makers et les Takers de l'Open Source</title><subtitle /><track>Communaut&#233;</track><type>conference</type><language /><description>&#192; bien des &#233;gards, l'Open Source a gagn&#233;. 
La plupart des gens savent que l&#8217;Open Source fournit des logiciels de meilleure qualit&#233;, &#224; moindre co&#251;t, sans blocage par les fournisseurs. Cependant, malgr&#233; l&#8217;adoption g&#233;n&#233;ralis&#233;e de l&#8217;Open Source de plus de 30 ans, la croissance et la p&#233;rennisation des projets Open Source restent difficiles.

Pour faire &#233;voluer et p&#233;renniser les &#233;cosyst&#232;mes Open Source de mani&#232;re plus efficace et &#233;quitable, les projets Open Source doivent adopter de nouveaux mod&#232;les de gouvernance, de coordination et d'incitation.</description><links /></event><room name="A202" /><event id="834"><persons /><person id="700">Louis-Alexis EYRAUD</person><person id="701">Fr&#233;d&#233;ric MARTINSONS</person><tags /><start>10:30</start><duration>01:00</duration><room>A202</room><slug>d-bus-mode-demploi</slug><title>D-Bus: mode d'emploi</title><subtitle /><track>Technique</track><type>conference</type><language /><description>D-Bus est un m&#233;canisme de communication inter-processus (IPC), tr&#232;s utilis&#233; dans les environnements GNOME et KDE. De part ses faibles d&#233;pendances, son abstraction haut niveau et des impl&#233;mentations en diff&#233;rents langages (C/C++, Python, Java...), il peut &#234;tre utilis&#233; pour tout type d'applications.

Cette conf&#233;rence pr&#233;sentera les concepts g&#233;n&#233;raux (bus, objet, interface...), fonctionnalit&#233;s, diff&#233;rentes impl&#233;mentations libres (dbus-glib, gdbus, python-dbus, qtdbus...)ainsi que des cas d'utilisations (CLI, applets...).</description><links /></event><event id="785"><persons /><person id="650">S&#233;bastien BAUDRU</person><tags /><start>11:30</start><duration>01:00</duration><room>A202</room><slug>auditability-your-want-more-logs</slug><title>Auditability : your want more logs !</title><subtitle /><track>S&#233;curit&#233;</track><type>conference</type><language /><description>EN : Syslog are are sometimes not sufficient. Relying on what a potentially flawed service to give your inputs on what has been made may be sufficient in many cases, but many systems are still lacking in having info on what happened outside these servers : on the disk, in the kernel, at the process level. That's were AuditD comes to help. While being overviewed as a complex system, it appears that, with bytes broken and explained separately, this is an incredible and very powerfull tool which may give you a real and comprehensive overview of what is happening on your system.

FR : les Syslog ne sont parfois pas suffisant. Se reposer sur ce qu'un service potentiellement faillible va bien vouloir &#233;crire peut certes &#234;tre suffisant dans la plupart des cas, mais beaucoup de serveurs manquent d'information sur ce qu'il s'est pass&#233; &#224; l'ext&#233;rieur du scope de ces services : sur le disque, dans le noyau, ou dans les processus. Et c'est l&#224; qu'interviens Auditd. Alors qu'on le voit comme une machine &#224; gaz complexe, il appara&#238;t que quand on regarde chaque fonctionnalit&#233; une par une, AuditD est un m&#233;canisme tr&#232;s puissant et incroyablement efficace pour donner une vue exhaustive et &#233;largie sur ce que fait vraiment un syst&#232;me Linux.</description><links /></event><event id="715"><persons /><person id="586">Nicolas GONZALEZ</person><tags /><start>15:00</start><duration>01:00</duration><room>A202</room><slug>reseau-iot-lora-ouvert-sur-toulouse-deploiement-ar</slug><title>R&#233;seau IoT LoRa ouvert sur Toulouse : d&#233;ploiement, architecture et enjeux citoyens</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Depuis 2 ans, l'association Tetaneutral.net d&#233;ploie des passerelles LoRa sur les villes de Toulouse et d'Albi.
Ce projet de recherche est port&#233; par Nicolas Gonzalez en th&#232;se au laboratoire IRIT &#224; l'IUT de Blagnac.

Nous intervenons au Capitole du Libre depuis le d&#233;but du projet pour expliquer le fonctionnement de ce r&#233;seau et comment il peut &#234;tre utilis&#233; pour des projets de recherche et/ou de p&#233;dagogie.

Suite &#224; vos nombreux retours, nous aborderons cette ann&#233;e plus en d&#233;tails les diff&#233;rentes architectures et leurs enjeux sur notre soci&#233;t&#233;. Sur les questions citoyennes, nous expliquerons notre vision sur le partage des bandes de fr&#233;quences libres.</description><links /></event><event id="784"><persons /><person id="650">S&#233;bastien BAUDRU</person><tags /><start>16:30</start><duration>01:00</duration><room>A202</room><slug>selinux-its-not-that-hard-anymore-and-you-may-want</slug><title>SELinux : it's not that hard anymore and you may want to give it another try</title><subtitle /><track>S&#233;curit&#233;</track><type>conference</type><language /><description>EN : SELinux had its fame years ago, though being still a young and complex process. As we were young and lazy, the many constraints and lack of docs, templates and tutorials lead us to think and spread the word that SELinux was overly complex for the standard usage of Linux. Through the year although, SELinux made great progress on its usability, and its now time for us to give it a new try and discover how easy can it be, today, to enhance greatly security in Linux to get rid of the DAC-only security we still are relying on. Who knows, after this presentation, you may remove the first step of your installation, "Disable SELinux" ?

FR : SELinux a connu son heure de gloire il y a bien des ann&#233;es, alors qu'il n'&#233;tait encore un framework jeune et tr&#232;s complexe. Alors jeunes et fain&#233;ants, nous avons rejet&#233; cet outil, parce qu'il &#233;tait trop complexe, qu'il manquait de documentation et de mod&#232;les d'utilisations. Pourtant, durant toutes ces ann&#233;es, SELinux a fait d'&#233;normes progr&#232;s, devant utilisable facilement; il est l'heure pour nous de lui donner une seconde chance et de d&#233;couvrir avec quelle simplicit&#233; on peut aujourd'hui am&#233;liorer la s&#233;curit&#233; de nos socles Linux, et arr&#234;te de se reposer enti&#232;rement sur le DAC. Qui sait, peut-&#234;tre voudrez-vous apr&#232;s cette pr&#233;sentation supprimer la premi&#232;re ligne des process d'installation : "D&#233;sactiver SELinux" ?</description><links /></event><event id="831"><persons /><person id="697">Adrien PLAZAS</person><tags /><start>17:30</start><duration>00:30</duration><room>A202</room><slug>comment-jai-glisse-gnome-dans-votre-poche</slug><title>Comment j'ai gliss&#233; GNOME dans votre poche</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Du, sang, de la sueur, des larmes, et des glitchs graphiques ! Embarquez pour une aventure de deux ans et d&#233;couvrez tout sur mon implication dans l'initiative GNOME Mobile, des premiers int&#233;r&#234;ts jusqu'&#224; joindre Purism et travailler sur le Librem 5 afin de porter GNOME sur les appareils mobiles.</description><links /></event><event id="828"><persons /><person id="695">Cl&#233;ment AUBIN</person><tags /><start>18:00</start><duration>00:30</duration><room>A202</room><slug>collaborative-edition-of-complex-documents-reducin</slug><title>Collaborative edition of complex documents - Reducing the overhead with XWiki</title><subtitle /><track>Technique</track><type>conference</type><language /><description>In this presentation, we will see how XWiki manages to streamline the collaborative editing of large documents by an important number of users (200+), while providing tools to :
* Strictly ensure the quality of the final document by allowing each document section to be individually reviewed * Review the overall progress of the document creation
* Know who edited which document section, when and why
* Allow to historize the document sections and the complete document We will demonstrate the capabilities of XWiki in this domain with some examples of the deployment of such solution at XWiki SAS.</description><links /></event><room name="A203" /><event id="724"><persons /><person id="601">Adrien VAN DEN BOSSCHE</person><tags /><start>10:30</start><duration>01:00</duration><room>A203</room><slug>localiser-ses-objets-connectes-a-10cm-dans-un-envi</slug><title>Localiser ses objets connect&#233;s &#224; 10cm dans un environnement int&#233;rieur</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Qui n'a jamais pass&#233; 10 minutes &#224; rechercher son t&#233;l&#233;phone, ses cl&#233;s ou son portefeuille le matin avant de partir de chez lui ? Demain, les objets connect&#233;s pourront s'auto-localiser dans un environnement int&#233;rieur et la maison connect&#233;e pourra dire : "tes cl&#233;s sont sous le canap&#233; !". Mais tout ceci est d&#233;j&#224; possible gr&#226;ce aux nombreuses techniques de localisation indoor rendues possible par les r&#233;seaux sans fil. Dans cette pr&#233;sentation, Adrien pr&#233;sentera un &#233;tat de l'art des possibilit&#233;s, ainsi que les outils mat&#233;riels et logiciels libres pour retrouver ses objets connect&#233;s et, si la technique le permet, une d&#233;monstration viendra cl&#244;turer la conf&#233;rence.</description><links /></event><event id="685"><persons /><person id="556">Thomas PERROT</person><tags /><start>11:30</start><duration>01:00</duration><room>A203</room><slug>construire-votre-propre-distribution-linux-personn</slug><title>Construire votre distribution Linux personnalis&#233;e pour votre syst&#232;me embarqu&#233;</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Cette pr&#233;sentation abordera toutes les &#233;tapes n&#233;cessaires &#224; la construction d'une distribution Linux embarqu&#233;e de la construction de la cha&#238;ne de cross compilation jusqu'&#224; la l'image bootable.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2019/construire-votre-propre-distribution-linux-personn/building_linux.pdf</link></links></event><event id="863"><persons /><person id="723">Julien DUROURE</person><tags /><start>15:00</start><duration>01:00</duration><room>A203</room><slug>format-dechange-libre-entre-blender-et-godot</slug><title>Format d'&#233;change libre entre Blender et Godot</title><subtitle /><track>3D</track><type>conference</type><language /><description>Blender et Godot font partie des logiciels libres phares pour le d&#233;veloppement de jeux vid&#233;os.
A travers plusieurs exemples, nous verrons les diff&#233;rents formats libres qu'il est possible d'utiliser pour &#233;changer des donn&#233;es entre Blender et Godot.
Nous nous attarderons plus particuli&#232;rement sur le format glTF2.0, dont Julien d&#233;veloppe et maintient l'importeur/exporteur de Blender.</description><links /></event><event id="692"><persons /><person id="561">Thibaud ARTIGUES</person><tags /><start>16:30</start><duration>01:00</duration><room>A203</room><slug>analyse-comparative-entre-blender-3ds-max-maya-zbr</slug><title>Blender vs 3DS Max / Maya / ZBrush : Analyse comparative</title><subtitle /><track>3D</track><type>conference</type><language /><description>Blender est consid&#233;r&#233; comme un outil multi usage, de la mod&#233;lisation &#224; la sculpture en passant par l'animation 2D. 
Mais que vaut-il vraiment par rapport &#224; ses concurrents ? L'objectif de cette conf&#233;rence est de comparer les principaux modules de Blender face aux applications propri&#233;taire comme 3ds MAX, Maya et ZBrush afin de d&#233;terminer les avantages et lacunes de celui-ci.</description><links /></event><room name="A301" /><room name="A302" /><event id="852"><persons /><person id="716">Elzen</person><tags /><start>10:30</start><duration>01:00</duration><room>A302</room><slug>libristes-parlons-science</slug><title>Libristes, parlons science&#8239;!</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Les sciences et le logiciel libre ont beaucoup en commun. Notamment le fait d'&#234;tre, &#224; la base, quelque chose qui se fait plut&#244;t dans les labos, mais dont on aurait pas mal int&#233;r&#234;t &#224; ce que &#231;a devienne quelque chose dont tout le monde s'empare. &#199;a vous dit qu'on parle un peu de &#231;a&#8239;? On en profitera pour faire quelques rappels utiles sur comment &#231;a marche dans les deux cas.</description><links /></event><event id="847"><persons /><person id="711">Rapha&#235;l YHARRASSARRY</person><tags /><start>11:30</start><duration>01:00</duration><room>A302</room><slug>du-design-de-lattention-a-lethique-du-designer</slug><title>Du design de l&#8217;attention &#224; l&#8217;&#233;thique du designer</title><subtitle /><track /><type>conference</type><language /><description>Quand je con&#231;ois une page, un service, je vais faire attention aux besoins des utilisateurs, &#224; leurs capacit&#233;s cognitives. Je vais les guider dans le parcours que j&#8217;estime pertinent pour eux. Je vais attirer &#224; leur attention vers certains &#233;l&#233;ments, la d&#233;tourner d&#8217;autres &#233;l&#233;ments que je juge secondaire. Je peux jouer avec diff&#233;rents biais cognitifs pour arriver &#224; mes fins. En allant plus loin, je peux mettre en place une strat&#233;gie pour que les utilisateurs adoptent librement certains comportements, voir cr&#233;er de l&#8217;addiction, que se soit num&#233;rique ou dans la vie r&#233;elle. Ces comportements peuvent &#234;tre vertueux ou justes servir les int&#233;r&#234;ts d&#8217;une entreprise. Quand est-ce que, moi, designer je passe la ligne rouge ? Quelles r&#232;gles je me fixe ou pas ? Il existe des codes de conduites comme celui de l&#8217;UXPA, mais concr&#232;tement &#231;a donne quoi quand on essaye de l&#8217;appliquer dans la vraie vie ?</description><links /></event><event id="708"><persons /><person id="575">Benjamin MERIEAU</person><person id="580">Pascal GILLET</person><tags /><start>15:00</start><duration>01:00</duration><room>A302</room><slug>comment-faire-du-lift-and-shift-sans-faire-de-comp</slug><title>Comment faire du "Lift and Shift" sans faire de compromis s&#233;curit&#233; ?</title><subtitle /><track /><type>conference</type><language /><description>Le Cloud public offre de nombreux avantages, et de nombreuses entreprises y migrent d&#233;sormais leurs applications. Mais si les entreprises per&#231;oivent le Cloud comme une opportunit&#233;, c'est aussi une importante source de risques de s&#233;curit&#233;. Les fournisseurs Cloud offrent d&#233;j&#224; des solutions de s&#233;curit&#233; int&#233;gr&#233;es (stockage, infrastructure, r&#233;seau) mais que ce soit pour des raisons de propri&#233;t&#233; intellectuelle, ou de r&#233;glementation, elles ne sont pas suffisantes. Les entreprises ont besoin de garanties suppl&#233;mentaires et de pouvoir &#233;tendre ou m&#234;me remplacer ces solutions de s&#233;curit&#233; jusqu'aux applications elles-m&#234;mes.
L'OWASP, dans son "Cloud Top 10 Security Risks", r&#233;v&#232;le que la propri&#233;t&#233; de la donn&#233;e et le respect des r&#233;glementations sont respectivement le 1er et 3&#232;me plus grand risque lors d'une migration dans le Cloud.
Dans cette pr&#233;sentation, nous allons vous montrer une architecture qui permet de d&#233;ployer ses applications sensibles dans le Cloud plus sereinement.
L'architecture s'appuie sur des composants Open Source, comme Gitlab, Kubernetes ou encore Vault de Hashicorp. Ces composants permettent &#233;galement de r&#233;duire grandement l&#8217;adh&#233;rence d'un projet &#224; un fournisseur de Cloud.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2019/comment-faire-du-lift-and-shift-sans-faire-de-comp/Lift_and_Shift_s%C3%A9curis%C3%A9.pdf</link></links></event><event id="740"><persons /><person id="616">Julien GARRIGUE</person><person id="702">Romain HUNAULT</person><tags /><start>16:30</start><duration>01:00</duration><room>A302</room><slug>e-your-data-is-your-data-lalternative-a-google-e-2</slug><title>/e/ "Vos donn&#233;es sont vos donn&#233;es" : L'alternative &#224; Google et Apple qui contribue &#224; la protection de votre vie priv&#233;e</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>"Vos donn&#233;es sont vos donn&#233;es"
Saviez-vous que votre t&#233;l&#233;phone peut r&#233;colter vos donn&#233;es tout au long de la journ&#233;e, enregistrant o&#249; vous &#234;tes, qui vous &#234;tes et ce que vous faites, 24h sur 24 et 7 jours sur 7 ?
Il est temps d&#8217;&#233;chapper &#224; la surveillance mobile !

Notre mission : rendre accessible &#224; tous une technologie qui respecte la vie priv&#233;e des utilisateurs.

Il est temps de reprendre le contr&#244;le de nos donn&#233;es personnelles sur nos t&#233;l&#233;phones !

Nous d&#233;veloppons des syst&#232;mes d&#8217;exploitation mobiles, des applications et des outils qui font passer la vie priv&#233;e des utilisateurs avant le profit.

Tout le monde m&#233;rite le respect de sa vie priv&#233;e, surtout sur son smartphone ! /e/ est un projet &#224; but non lucratif, port&#233; par une &#233;quipe internationale d&#8217;entrepreneurs, de d&#233;veloppeurs et de concepteurs exp&#233;riment&#233;s, et par une communaut&#233; de collaborateurs en pleine croissance.</description><links /></event><event id="792"><persons /><person id="566">Marina FERN&#193;NDEZ DE RETANA</person><person id="609">Squeeek</person><person id="655">David REVOY</person><person id="656">Gee</person><person id="657">St&#233;phane CROZAT</person><person id="658">Yann Kervran</person><person id="737">Terhemis</person><tags /><start>17:30</start><duration>01:00</duration><room>A302</room><slug>les-pages-liberees-table-ronde-autour-du-livre-lib</slug><title>Les pages lib&#233;r&#233;es : table ronde autour du livre libre</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Vous avez pris l'habitude d'utiliser, voire de contribuer &#224; des logiciels libres ? Bravo ! Et si vous passiez aussi &#224; la culture libre, avec une table ronde d&#233;di&#233;e &#224; un objet qui peut &#234;tre physique ou num&#233;rique : le livre. Quelques auteurs de romans, essais et autres BDs pr&#233;senteront divers aspects li&#233;s &#224; ce m&#233;dia un peu particulier : diffusion, licences, financement, outils, formation... petit tour d'horizon d'un objet culturel ancien qui se renouvelle avec le num&#233;rique et l'&#233;thique des communs.
Participants : David Revoy (https://www.davidrevoy.com/), Gee (https://grisebouille.net), Kaoseto (http://bardinflor.perso.aquilenet.fr/), St&#233;phane Crozat (http://punkardie.fr/), Terhemis (https://terhemis.fr/), Yann Kervran (https://www.hexagora.fr)</description><links /></event><room name="B00" /><event id="878"><persons /><person id="554">Capitole du Libre</person><tags /><start>10:00</start><duration>00:30</duration><room>B00</room><slug>bienvenue-au-capitole-du-libre-2019</slug><title>Bienvenue au Capitole du Libre 2019</title><subtitle /><track /><type>keynote</type><language /><description>Introduction au week-end du Capitole du Libre.</description><links /></event><event id="702"><persons /><person id="570">Framasoft (Pouhiou)</person><tags /><start>11:30</start><duration>01:00</duration><room>B00</room><slug>carnets-de-voyage-2-ans-dexploration-de-contributo</slug><title>Carnets de voyage : 2 ans d'exploration de Contributopia</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Depuis deux ans que nous avons annonc&#233; notre feuille de route "Contributopia", nous avons explor&#233; bien des pistes. Au capitole du Libre de l'an dernier, nous expliquions que D&#233;googliser ne suffit pas, que le logiciel libre ne suffit pas, qu'il doit s'inscrire dans une vision politique.

Pour nous, face au syst&#232;me complexe tiss&#233; par les g&#233;ants du web, il faut une r&#233;ponse tout aussi complexe et construite de mani&#232;re radicalement diff&#233;rente.

Voil&#224; deux ans que Framasoft sort de sa zone de confort, et va &#224; la rencontre d'autres communaut&#233;s qui partagent les valeurs-cl&#233;s du Libre, mais dans d'autres domaines. Il est temps de faire le point sur ce que nous avons pu faire avec ces Autres qui nous ressemblent, et sur ce que nous retenons de nos r&#233;ussites comme de nos errements !</description><links /></event><event id="881"><persons /><person id="691">Sandrine MATHON</person><person id="773">Vincent PRIVAT</person><person id="774">Raphael ISLA</person><person id="775">Tristan NITOT</person><tags /><start>14:00</start><duration>01:00</duration><room>B00</room><slug>table-ronde-samedi</slug><title>Table ronde: faisons le point sur les donn&#233;es (ouvertes, priv&#233;es, personnelles)</title><subtitle /><track /><type>conference</type><language /><description>Quatre points:
&#201;tat actuel
&#201;volution pass&#233;e et tendance de cette &#233;volution
&#201;volution pr&#233;vue / pr&#233;visible
Citoyens, devez-vous craindre pour vos donn&#233;es personnelles ?</description><links /></event><event id="821"><persons /><person id="691">Sandrine MATHON</person><tags /><start>15:00</start><duration>01:00</duration><room>B00</room><slug>open-data-lage-de-la-maturite</slug><title>Open Data : l'age de la maturit&#233;</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Apr&#232;s le temps des pionniers, puis de l'extension de l'ouverture des donn&#233;es publiques, voici le temps de la maturit&#233;. o&#249; en sont les collectivit&#233;s 1 an apr&#232;s l'obligation de l'open data par principe ? quelles avanc&#233;es ? quelle g&#233;n&#233;ralisation ? 
Un point sera fait &#233;galement sur la coop&#233;ration entre collectivit&#233; en Occitanie</description><links /></event><event id="689"><persons /><person id="559">&#201;tienne GONNU</person><tags /><start>16:30</start><duration>01:00</duration><room>B00</room><slug>le-logiciel-libre-un-enjeu-politique-et-social-dis</slug><title>Le logiciel libre : un enjeu politique et social. Discussion autour de l&#8217;action institutionnelle de l&#8217;April</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Par les libert&#233;s qu&#8217;ils offrent, les logiciels libres sont d&#8217;une certaine mani&#232;re la traduction informatique des &#233;l&#233;ments structurants d&#8217;une d&#233;mocratie, notamment exprim&#233;s dans la devise : libert&#233;, &#233;galit&#233;, fraternit&#233;.

Cette analogie, souvent entendue, n'a rien perdu de sa justesse : le logiciel libre est plus que jamais un enjeu fondamentalement politique et social. Et c'est fort de cette conviction que l'April m&#232;ne ses actions visant &#224; d&#233;fendre et promouvoir les libert&#233;s informatiques de toutes et de tous.

Cette conf&#233;rence se propose ainsi de pr&#233;senter et d'&#233;changer sur les diff&#233;rentes actions institutionnelles de l'association : directive droit d'auteur, &#171; &#233;conomie circulaire &#187;, priorit&#233; au logiciel libre ou encore Open Bar.</description><links /></event><event id="747"><persons /><person id="621">Marc REES</person><tags /><start>17:30</start><duration>01:00</duration><room>B00</room><slug>inventaire-des-dernieres-menaces-legislatives-sur-</slug><title>Inventaire des derni&#232;res menaces l&#233;gislatives sur la libert&#233; d'expression</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Panorama des derniers textes publi&#233;s en Europe et en France avec accent mis sur :

- La proposition de loi Avia contre "la haine en ligne"
- La directive sur le droit d'auteur
- La directive relative aux services de m&#233;dias audiovisuels

Autant de menaces pesant sur la libert&#233; d'expression sur les plateformes comme Twitter, YouTube et les autres. Explications des rouages l&#233;gislatifs, &#233;clairage synth&#233;tique sur les risques, identifications de points concrets.</description><links /></event><event id="883"><persons /><person id="554">Capitole du Libre</person><tags /><start>19:00</start><duration>01:00</duration><room>B00</room><slug>table-ronde-2</slug><title>Table ronde sur les mod&#232;les de financement du Logiciel Libre</title><subtitle /><track /><type>keynote</type><language /><description>Table ronde</description><links /></event><room name="B006-B007" /><event id="748"><persons /><person id="620">Fabien BENETOU</person><tags /><start>10:30</start><duration>02:00</duration><room>B006-B007</room><slug>webar-hackathon-using-geospatial-dataset-with-augm</slug><title>WebAR hackathon, using geospatial dataset with augmented reality on the web</title><subtitle /><track /><type>atelier</type><language /><description>In preparation for the Open Geospatial Consortium meeting in Toulouse during the week https://www.opengeospatial.org/events/1911tc we invite developers, designers, geospatial expert to gather and explore innovation solutions. The goal is to provide the possibility for hands-on explorations of emerging standard technologies like WebXR with open dataset and create as teams. Participants will be invited to organize heterogeneous teams and create over the course of the entire 2 days working proof of concepts. The focus will be on supporting participant to get the very first steps in order to create novel solutions relying on free and open source software then share back to the community their results.</description><links /></event><event id="897"><persons /><person id="620">Fabien BENETOU</person><tags /><start>15:00</start><duration>01:00</duration><room>B006-B007</room><slug>webar-hackathon-using-geospatial-dataset-with-au-2</slug><title>WebAR hackathon, using geospatial dataset with augmented reality on the web</title><subtitle /><track /><type>atelier</type><language /><description>WebAR hackathon, using geospatial dataset with augmented reality on the web</description><links /></event><event id="898"><persons /><person id="620">Fabien BENETOU</person><tags /><start>16:30</start><duration>02:00</duration><room>B006-B007</room><slug>webar-hackathon-using-geospatial-dataset-with-au-3</slug><title>WebAR hackathon, using geospatial dataset with augmented reality on the web</title><subtitle /><track /><type>atelier</type><language /><description>WebAR hackathon, using geospatial dataset with augmented reality on the web</description><links /></event><room name="B104" /><event id="683"><persons /><person id="554">Capitole du Libre</person><tags /><start>10:30</start><duration>02:00</duration><room>B104</room><slug>atelier-installation-depannage-linux-11</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><event id="887"><persons /><person id="554">Capitole du Libre</person><tags /><start>14:00</start><duration>02:00</duration><room>B104</room><slug>atelier-installation-depannage-linux-12</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><event id="888"><persons /><person id="554">Capitole du Libre</person><tags /><start>16:30</start><duration>02:00</duration><room>B104</room><slug>atelier-installation-depannage-linux-13</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><room name="B207" /><event id="744"><persons /><person id="619">hellosct1</person><tags /><start>16:30</start><duration>02:00</duration><room>B207</room><slug>la-boite-a-outils-de-developpements-dans-firefox</slug><title>La bo&#238;te &#224; outils de d&#233;veloppements dans Firefox</title><subtitle /><track>Web</track><type>atelier</type><language /><description>Quel que soit le d&#233;veloppement et le r&#233;sultat souhait&#233;, l&#8217;&#233;quipe doit pouvoir finaliser son code sur le p&#233;riph&#233;rique (device) final. Celui-ci peut &#234;tre un navigateur, un t&#233;l&#233;phone, une tablette,etc.

&#192; travers des d&#233;monstrations, nous verrons les ressources disponibles et faciles d&#8217;utilisation pour modifier et d&#233;boguer les diff&#233;rents langages du back office et front office (HTML, CSS, JavaScript, PHP&#8230;) pour ne pas avoir un rendu cass&#233; lors de la livraison.

Ainsi, vous pourrez optimiser vos sites web avec le panneau d&#8217;accessibilit&#233;, les fonts variables, les performances, le responsive&#8230;) avec les devtools (outils de d&#233;veloppement) &#224; travers les nouvelles fonctionnalit&#233;s.</description><links /></event><room name="B208" /><event id="849"><persons /><person id="713">Maiwann</person><tags /><start>16:30</start><duration>02:00</duration><room>B208</room><slug>cest-lheure-du-ttttttest-utilisateur</slug><title>C'est l'heure du ttttt&#8230;test utilisateur !</title><subtitle /><track /><type>atelier</type><language /><description>Est-ce que votre logiciel est bien con&#231;u ? Est-il trop compliqu&#233; ? Comment savoir ce qui cloche et quelles sont les fonctionnalit&#233;s les plus appr&#233;ci&#233;es ? 

En faisant des tests utilisateurs ! 

Venez tester ou faire tester des logiciels libres pour d&#233;couvrir comment r&#233;aliser des observations, obtenir des retours de qualit&#233;, et am&#233;liorer un logiciel pour rendre ses utilisateur&#183;ices heureux&#183;ses \o/</description><links /></event><room name="B306" /><room name="B307" /><event id="866"><persons /><person id="726">Myriam Criquet</person><person id="727">Pascal Arnoux</person><tags /><start>16:30</start><duration>02:00</duration><room>B307</room><slug>lodd-4-bouscule-par-le-numerique-libre-quest-ce-qu</slug><title>L&#8217;ODD 4 bouscul&#233; par le num&#233;rique libre. Qu&#8217;est-ce qu&#8217;une &#233;ducation de qualit&#233; au num&#233;rique libre (atelier, 2h)</title><subtitle /><track /><type>atelier</type><language /><description>A travers un atelier p&#233;dagogique innovant, interactif, ludique, bas&#233; sur la projection de vid&#233;os, des jeux, un questionnement et des retours d&#8217;exp&#233;riences, l&#8217;auditoire sera amen&#233; &#224; se poser des questions essentielles pour trouver ce qui d&#8217;apr&#232;s lui constitue une &#233;ducation de qualit&#233; au num&#233;rique libre.
A la fin de l&#8217;atelier, un livrable sous forme de mindmapping permet de fixer l&#8217;&#233;tat de r&#233;flexion du groupe.</description><links /></event><room name="B308" /><event id="841"><persons /><person id="595">Tracim</person><person id="597">Damien ACCORSI</person><person id="599">Bastien SEVAJOL</person><tags /><start>16:30</start><duration>02:00</duration><room>B308</room><slug>envoyez-vos-documents-en-un-seul-clic</slug><title>Envoyez vos documents en un seul clic !</title><subtitle /><track>Technique</track><type>atelier</type><language /><description>Vous voulez partager les photos de votre week-end avec vos amis simplement ? Nous allons le faire, et en un clic !

Ce qu'on va faire durant l'atelier  :

   - Cr&#233;er un script disponible via clic droit dans l'explorateur de fichiers (OS Linux)
   - Envoyer les documents s&#233;lectionn&#233;s sur tracim &#224; partir de cette commande
   - Cr&#233;er un partage tracim vers les adresses emails saisies

Au d&#233;but de l'atelier, nous nous assurons que chaque participant ait acc&#232;s &#224; tracim, en l'installant sur sa propre machine ou bien en utilisant une instance que nous avons pr&#233;par&#233;e pour l'occasion.

Cet atelier a pour but de cr&#233;er/r&#233;diger un script permettant d'ajouter un raccourci dans l'explorateur de fichier, qui permet au clic droit d'acc&#233;der &#224; l'option &#171; envoyer mon fichier/dossier vers tracim &#187; (possible sous Debian/Ubuntu) et de connecter ce script &#224; tracim.

Le fichier/dossier est alors envoy&#233; dans tracim. Lorsque l'utilisateur s&#233;lectionne cette option, une pop-up s'affiche permettant de saisir un email &#224; qui envoyer un lien de t&#233;l&#233;chargement du fichier/dossier envoy&#233;.

Seront n&#233;cessaire :

   - Un ordinateur sous linux
   - Acc&#232;s &#224; internet (&#224; priori fourni par l'organisation ?)
   - Connaissance langage python pour r&#233;diger le script (non obligatoire)
   - explorateur de fichier nautilus ou thunar</description><links /></event><room name="C002" /><event id="867"><persons /><person id="726">Myriam Criquet</person><tags /><start>10:30</start><duration>00:30</duration><room>C002</room><slug>le-droit-penal-a-lheure-du-digital-retour-aux-fond</slug><title>le droit p&#233;nal &#224; l'heure du digital : retour aux fondamentaux ?</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>D&#232;s l&#8217;origine, l&#8217;informatique a bouscul&#233; et interrog&#233; le droit, particuli&#232;rement le droit p&#233;nal. L&#8217;ampleur des atteintes possibles, mais aussi des opportunit&#233;s que g&#233;n&#233;raient cet outil nouveau a augment&#233; au fur et &#224; mesure que les techniques ont &#233;volu&#233;es.
Aujourd&#8217;hui, que dire au final, sinon que les questions qui se posent &#224; nous, malgr&#233; les outils techniques et juridiques toujours nouveaux se succ&#233;dant, ont d&#233;j&#224; trouv&#233; un embryon de r&#233;ponse par le pass&#233; ? Que constater, sinon qu&#8217;au fond, nous devrions
poursuivre le m&#234;me objectif de permettre une r&#233;silience &#224; celui qui est dans le juste. 
Mais d&#233;sormais l&#8217;&#233;volution de la technique sous sa forme actuelle permet -elle encore d&#8217;y arriver ? Et si oui, comment ?</description><links /></event><event id="771"><persons /><person id="642">Julien OSMAN</person><tags /><start>11:00</start><duration>00:30</duration><room>C002</room><slug>rien-a-cacher-vous-devriez</slug><title>Rien &#224; cacher ? Vous devriez...</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Nous verrons ensemble ce que sont les algorithmes d'apprentissage automatique tels que le Deep Learning, ainsi que le Big Data, &#224; la mode en ce moment. Nous verrons aussi comment les Google, Facebook, Microsoft et les autres utilisent ces technologies pour nous manipuler, et en quoi ces manipulations peuvent &#234;tre graves pour nous, et pour nos d&#233;mocraties. Pour finir, nous verrons pourquoi certains logiciels libres permettent de nous prot&#233;ger en partie de ces manipulations.

Cette conf&#233;rence s'adresse &#224; ceux qui n'ont rien &#224; cacher, et qui ne comprennent pas pourquoi le cousin libriste dit tout le temps que Facebook et Whatsapp ne sont pas bien et qu'il vaut mieux utiliser des trucs de geeks. Le cousin libriste est le bienvenu &#224; cette conf&#233;rence s'il souhaite avoir quelques arguments la prochaine fois qu'il proposera de cr&#233;e un groupe familial sur Signal pour remplacer celui de Messager.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2019/rien-a-cacher-vous-devriez/presentation.pdf</link></links></event><event id="787"><persons /><person id="652">taziden</person><tags /><start>11:30</start><duration>01:00</duration><room>C002</room><slug>censure-de-sites-imposee-aux-fai-ou-en-est-on</slug><title>Censure de sites impos&#233;e aux FAI : o&#249; en est on ?</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>Cette conf&#233;rence a pour double objectif de
- faire le tour des possiblit&#233;s de censure de sites pr&#233;vues dans la loi
- revenir sur ce qu'il s'est pass&#233; depuis la pr&#233;c&#233;dente conf&#233;rence datant de 2017 (https://2017.capitoledulibre.org/programme/#etat-des-lieux-de-la-censure-de-sites-web-en-franc).

Depuis 2017, les deux sites Indymedia Nantes et Indymedia Grenoble ont failli &#234;tre censur&#233;s par voie administrative (&#224; la demande du minist&#232;re de l'Int&#233;rieur).
C'est l'opposition de la personnalit&#233; qualifi&#233;e de la CNIL qui m&#232;nera le tribunal administratif de Cergy &#224; se prononcer contre cette censure en annulant la d&#233;cision du minist&#232;re de l'Int&#233;rieur.

C'est un sujet qui fait souvent l'objet de confusions et cette conf&#233;rence a pour but ultime d'apporter un peu de clart&#233;.
Nous verrons &#233;galement les diff&#233;rents moyens de v&#233;rifier si un site est censur&#233;, et par quel moyen technique il l'est.</description><links /></event><event id="839"><persons /><person id="706">Lila</person><person id="707">&#201;tienne MAYNIER</person><tags /><start>15:00</start><duration>01:00</duration><room>C002</room><slug>hacker-resister</slug><title>Hacker == R&#233;sister ?</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>2019. On nous a vol&#233; notre Internet. On avait l'espoir de changer le monde avec des valeurs de partage, d'ouverture, d'autogestion et de d&#233;mocratie, mais le capitalisme, entre autres, a tout absorb&#233;. On se retrouve dans une soci&#233;t&#233; sous surveillance, o&#249; nos libert&#233;s sont restreintes et o&#249; nos choix ne sont plus que des compromis. Que reste-t-il aujourd'hui de ce qui nous a pouss&#233; &#224; vouloir r&#233;inventer le monde ?

Le terme existe depuis les ann&#233;es 80, mais qu'est-ce que &#231;a veut vraiment dire, "hacker" ? La question nous taraude depuis des ann&#233;es, alors on a lu, r&#233;fl&#233;chi, discut&#233;, et essay&#233; de d&#233;m&#234;ler ce qui nous para&#238;t important dans cette culture. &#192; partir d'une discussion sur la cr&#233;ation du mouvement hacker et d'exemples actuels, nous proposons d'aborder ce sujet sous l'angle de l'&#233;thique et de nos responsabilit&#233;s &#224; un moment o&#249; technologie et politique n'ont jamais eu autant d'importance et d'impact&#160;dans nos vies.</description><links /></event><event id="814"><persons /><person id="683">Bastien - La Quadrature du Net</person><tags /><start>16:30</start><duration>01:00</duration><room>C002</room><slug>censure-du-net-1-comprendre-le-droit</slug><title>Censure du Net (1) : comprendre le droit</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>2020 sera l'ann&#233;e de la censure : loi contre la haine, r&#232;glement terroriste, transposition de la directive copyright, r&#233;forme du statut des h&#233;bergeurs. La lutte sera ardue. Pour la pr&#233;parer, La Quadrature du Net vous propose deux conf&#233;rences. Une premi&#232;re pour comprendre le droit, pass&#233; et &#224; venir. Un seconde pour pr&#233;parer nos arguments afin de prot&#233;ger le Net.</description><links /></event><event id="813"><persons /><person id="682">Arthur - La Quadrature du Net</person><tags /><start>17:30</start><duration>01:00</duration><room>C002</room><slug>censure-du-net-2-preparer-la-lutte</slug><title>Censure du Net (2) : pr&#233;parer la lutte</title><subtitle /><track>Libert&#233;s et Vie Priv&#233;e</track><type>conference</type><language /><description>2020 sera l'ann&#233;e de la censure : loi contre la haine, r&#232;glement terroriste, transposition de la directive copyright, r&#233;forme du statut des h&#233;bergeurs. La lutte sera ardue. Pour la pr&#233;parer, La Quadrature du Net vous propose deux conf&#233;rences. Une premi&#232;re pour comprendre le droit, pass&#233; et &#224; venir. Un seconde pour pr&#233;parer nos arguments afin de prot&#233;ger le Net.</description><links /></event><room name="Foyer des &#201;tudiants" /><event id="880"><persons /><person id="554">Capitole du Libre</person><tags /><start>12:30</start><duration>01:30</duration><room>Foyer des &#201;tudiants</room><slug>pause-dejeuner-5</slug><title>Pause d&#233;jeuner</title><subtitle /><track /><type>keynote</type><language /><description>Pause d&#233;jeuner</description><links /></event><event id="882"><persons /><person id="554">Capitole du Libre</person><tags /><start>16:00</start><duration>00:30</duration><room>Foyer des &#201;tudiants</room><slug>pause-3</slug><title>Pause</title><subtitle /><track /><type>keynote</type><language /><description>Pause</description><links /></event><event id="884"><persons /><person id="554">Capitole du Libre</person><tags /><start>20:00</start><duration>02:00</duration><room>Foyer des &#201;tudiants</room><slug>buffet-offert-par-lassociation-toulibre-3</slug><title>Buffet offert par l'association Toulibre</title><subtitle /><track /><type>keynote</type><language /><description>Buffet convivial r&#233;unissant intervenants, speakers, organisateurs et public au Foyer des Etudiants.</description><links /></event></day><day date="2019-11-17" index="2"><room name="A001" /><event id="868"><persons /><person id="728">R&#233;gis PERDREAU</person><tags /><start>10:30</start><duration>01:00</duration><room>A001</room><slug>libreoffice-comment-contribuer</slug><title>LibreOffice, comment contribuer ?</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Comment s'organise le projet LibreOffice et en particulier la communaut&#233; fr ? Si les utilisateurs de LibreOffice sont nombreux, la contribution est toujours la bienvenue. De la r&#233;daction de la documentation, &#224; la promotion, &#224; l'organisation du meeting annuel LiboCon, en passant par le code nous parlerons de diff&#233;rentes mani&#232;res d'aider le projet chez vous, quel que soit vos comp&#233;tences, pour qu'&#224; votre tour vous mettiez le pied &#224; l'&#233;trier.</description><links /></event><event id="862"><persons /><person id="720">Ludovic DUBOST</person><tags /><start>11:30</start><duration>01:00</duration><room>A001</room><slug>cryptpad-une-plateforme-100-chiffree</slug><title>CryptPad - une plateforme 100% chiffr&#233;e</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Nous avons pr&#233;sent&#233; le concept et l'avancement de CryptPad l'ann&#233;e derni&#232;re au Capitole du Libre. L'objectif de cette pr&#233;sentation sera de pr&#233;senter les nouveaut&#233;s d&#233;velopp&#233;es cette ann&#233;e grace au financement NLNet (https://nlnet.nl/PET/) apportant plus de fonctionnalit&#233;s pour les &#233;quipes.
La pr&#233;sentation permettra aussi de rappeler l'importance de l'approche 100% chiffr&#233;e mise en oeuvre dans le projet afin de prot&#233;ger la vie priv&#233;e des utilisateurs.</description><links /></event><event id="809"><persons /><person id="676">Alex MARANDON</person><tags /><start>14:00</start><duration>01:00</duration><room>A001</room><slug>elixir-plus-quun-langage-une-plateforme</slug><title>Elixir : plus qu'un langage, une plateforme</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Elixir fournit un outillage et une syntaxe modernes donnant acc&#232;s &#224; la plateforme Erlang/OTP. Cette plateforme robuste impl&#233;mente un certain nombre de concepts int&#233;ressants qui sont peu pr&#233;sents dans les &#233;cosyst&#232;me plus r&#233;pandus. Pattern matching, concurrence par passage de messages immutables et arbres de supervision sont autant de caract&#233;ristiques singuli&#232;res qui font de Elixir un outil de choix pour le web temps r&#233;el, les pipelines de traitement de donn&#233;es ou m&#234;me l'embarqu&#233;.

Je t&#226;cherai lors de cette pr&#233;sentation de vous transmettre l'esprit de cette plateforme et de vous faire entrevoir ses possibilit&#233;s.</description><links /></event><event id="872"><persons /><person id="733">Yann LE DOAR&#201;</person><tags /><start>15:00</start><duration>01:00</duration><room>A001</room><slug>your-distro-from-scratch</slug><title>Your Distro From Scratch</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Pr&#233;sentation de la version 2.7 de l'outil "Your Distro From Scratch"

Cet outil qui sert &#224; g&#233;n&#233;rer la distribution "LinuxConsole" (la plus ancienne distribution francophone) peut &#233;galement &#234;tre utilis&#233; pour se faire une distribution 'personnalis&#233;e'

Cette conf&#233;rence vous permettra de comprendre l'historique des distributions Linux en g&#233;n&#233;ral, et les derni&#232;res &#233;volutions

* Introduction
- Qu'est ce qu'une distribution Linux ?
- De LinuxConsole &#224; YDFS

* YDFS 2.7

- Dockerisation du build
La version 2.7 utilise massivement la technologie docker et permet ainsi de faire des builds depuis n'importe quelle distribution (et m&#234;me depuis windows).

- Mode "multi" modules.
Il est maintenant possible de faire des distributions hybrides

- Outil de contr&#244;le parental
Il est possible de d&#233;finir un temps "limit&#233;" pour des enfants pour une journ&#233;e, bas&#233; sur le temps d'utilisation des sessions.</description><links /></event><room name="A002" /><event id="864"><persons /><person id="724">Matiou</person><person id="752">Nadou</person><tags /><start>10:30</start><duration>01:00</duration><room>A002</room><slug>le-dividende-universel-lunite-de-mesure-economique</slug><title>Le Dividende Universel : l'unit&#233; de mesure &#233;conomique sous logiciel libre.   (les enjeux du libre)</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>La Monnaie Libre &#286;1 (june) est appel&#233;e ainsi parce qu'aucun humain partie prenante de sa coproduction n'a de privil&#232;ge en mati&#232;re de cr&#233;ation ni dans l'espace (entre individus &#224; un instant donn&#233;) ni dans le temps (entre g&#233;n&#233;rations successives).
Non seulement tous cr&#233;ent la m&#234;me part de monnaie via un m&#234;me dividende univsersel (DU), mais aussi la somme sur une longue periode de ces DU convergera vers la moyenne de monnaie par personne, ind&#233;pendamment de la date d'entr&#233;e, &#233;tablissant ainsi une sym&#233;trie interg&#233;n&#233;rationnelle. 
La libert&#233; pouvant &#234;tre d&#233;finie comme de la non-nuisance, c'est ici l'absence de privil&#232;ges de cr&#233;ation qui en est le fondement et qui peut positionner la &#286;1 comme une bonne candidate pour &#234;tre choisie par certains humains comme nouvelle unit&#233; de mesure economique du fait de cette propri&#233;t&#233; d'invariance.
La lettre &#286; a &#233;t&#233; choisie comme symbole du non-connu, de la nouveaut&#233;, de la cr&#233;ation de valeurs &#233;conomiques ind&#233;cidables, en r&#233;f&#233;rence au grand logicien Kurt G&#246;del pour son th&#233;or&#232;me d'incompl&#233;tude &#233;tabli en 1931, ainsi qu'au projet GNU lanc&#233; par Richard Stallman en 1983 (fondateur des logiciels libres qui sont rest&#233;s et restent inconnus de beaucoup, alors qu'ils sont notamment l'armature de 99% d'Internet).</description><links /></event><event id="860"><persons /><person id="719">Skeptik&#243;n</person><tags /><start>11:30</start><duration>01:00</duration><room>A002</room><slug>peertube-esprit-critique-les-enjeux-de-skeptikon</slug><title>PeerTube, esprit critique&#8239;: les enjeux de Skeptik&#243;n</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Skeptik&#243;n est une plateforme d'h&#233;bergement de vid&#233;o d'esprit critique traitant de l'esprit critique, de la z&#233;t&#233;tique ou de la m&#233;thodologie scientifique et bas&#233;e sur PeerTube.

Nous verrons pourquoi &#224; l'&#232;re o&#249; les fakes news prolif&#232;rent, il est d'autant plus important pour notre d&#233;mocratie de d&#233;fendre ces th&#232;mes. Pourquoi il est important de prendre conscience des limites de YouTube pour la vulgarisation. Et enfin pourquoi PeerTube est une meilleure plateforme pour g&#233;rer les contenus traitant de ces sujets.</description><links /></event><event id="842"><persons /><person id="588">Denis DORDOIGNE</person><tags /><start>14:00</start><duration>01:00</duration><room>A002</room><slug>les-10-paliers-de-liberation-dun-telephone-android</slug><title>Les 10 paliers de lib&#233;ration d'un t&#233;l&#233;phone android</title><subtitle /><track>Les enjeux du libre</track><type>conference</type><language /><description>Android est bas&#233; sur un logiciel libre, et peut &#234;tre utilis&#233; avec des logiciels libre. Il existe 10 paliers de migration d'un t&#233;l&#233;phone Android vers un t&#233;l&#233;phone totalement libre, les premiers sont faciles &#224; passer, les derniers demandent un plus grand engagement, mais on peut s'arr&#234;ter au niveau que l'on souhaite apr&#232;s avoir avanc&#233; autant qu'on le pouvait. Nous pr&#233;senterons ici chacun de ces 10 paliers, comment et pourquoi les atteindre, le but &#233;tant chacun sache ce qui est possible avant de d&#233;cider de son objectif.</description><links /></event><event id="859"><persons /><person id="559">&#201;tienne GONNU</person><person id="718">Christian MOMON</person><tags /><start>15:00</start><duration>01:00</duration><room>A002</room><slug>sous-la-loi-le-libre</slug><title>Sous la loi le libre</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>D&#233;cryptage de quelques joutes verbales dans l'h&#233;micycle. Depuis plus de douze ans, l'April agit pour sensibiliser et  mobiliser les parlementaires sur les enjeux du logiciel libre.</description><links /></event><room name="A201" /><event id="746"><persons /><person id="620">Fabien BENETOU</person><tags /><start>10:30</start><duration>01:00</duration><room>A201</room><slug>realite-augmentee-et-realite-virtuelle-sur-le-web-</slug><title>Realite augmentee et realite virtuelle sur le web, etat des lieux</title><subtitle /><track>Web</track><type>conference</type><language /><description>Realite augmentee et realite virtuelle fonctionnent. Vous pouvez en effet des aujourd'hui utiliser votre telephone et avoir l'experience d'etre ailleurs ou d'avoir des informations supplementaires en surcouche du monde reel. La question devient donc maintenant comment. Comment est-il possible de creer de telles experiences dans des conditions respectant la vie privee et en utilisant un ensemble d'outils efficaces et permettant de creer ?

Durant cette presentaiton nous allons explorer les differents outils possible, depuis le fonctionnement des senseurs des differents casque jusqu'a la creation de modeles 3D integree dans une page web affichee sur un casque de realitee augmentee, realitee virtuelle ou bien simplement un telephone.</description><links /></event><event id="696"><persons /><person id="565">Remy FONTAYNE</person><tags /><start>11:30</start><duration>01:00</duration><room>A201</room><slug>pourquoi-le-developpement-web-est-si</slug><title>Pourquoi le d&#233;veloppement web est si ...</title><subtitle /><track>Web</track><type>conference</type><language /><description>En moins de 10 ans, l'&#233;cosyst&#232;me javascript a rapidement &#233;volu&#233;, a tel point qu'il est d&#233;sormais difficile de s'y retrouver.

Cette pr&#233;sentation s&#8217;adresse aux v&#233;t&#233;rans &#224; la recherche de s&#233;r&#233;nit&#233; ou aux novices d&#233;sireux de se lancer dans le d&#233;veloppement web "moderne", mais rebut&#233; par son apparente complexit&#233; (TypeScript, SCSS, Gulp, Yarn, Bower, Grunt, Webpack, Browserify, NodeJS, NPM, Angular, React, Meteor, Ember, JQuery).

Nous &#233;tudierons les raisons qui ont amen&#233; &#224; l'apparition de ses nouvelles technos puis nous ferons une d&#233;monstration d'une cr&#233;ation d'une webapp "pure" qui n'utilise *aucune* des techno pr&#233;c&#233;demment cit&#233;es.

slides: http://niris.github.io/slides-web</description><links /></event><event id="745"><persons /><person id="619">hellosct1</person><tags /><start>14:00</start><duration>01:00</duration><room>A201</room><slug>la-securite-au-cur-des-projets-web-de-demain</slug><title>La s&#233;curit&#233; au c&#339;ur des projets web de demain</title><subtitle /><track>Web</track><type>conference</type><language /><description>Les failles de s&#233;curit&#233; web sont connues et reconnues. Cependant, elles sont toujours bien pr&#233;sentes, malgr&#233; les diff&#233;rentes publications du rapport de s&#233;curit&#233; r&#233;alis&#233;es par l'Open Web Application Security Project (OWASP). 

Cette session abordera ce que vous devez conna&#238;tre et le moyen d'appr&#233;hender la s&#233;curit&#233; &#224; partir de ce rapport, ce qui peut sembler compliqu&#233; &#224; sa premi&#232;re lecture. Cette session adoptera le point de vue des utilisateurs, des d&#233;veloppeurs et des chefs de projets pour mieux d&#233;finir la localisation des failles et vous montrera comment appliquer la m&#233;thode &#224; vos diff&#233;rents projets. 

En bonus : les failles ne se limitent pas aux projets web, mais touchent aussi les mobiles et les objets connect&#233;s comme le montre les autres publications de la fondation.</description><links /></event><event id="843"><persons /><person id="708">Fran&#231;ois BARBUT</person><tags /><start>15:00</start><duration>01:00</duration><room>A201</room><slug>haxe-4-un-typescript-pour-php</slug><title>Haxe 4, un typescript pour PHP ?</title><subtitle /><track>Web</track><type>conference</type><language /><description>Il existe maintenant plusieurs langages qui permettent de compiler vers Javascript, dont Typescript est certainement le plus connu. Mais qu'en est il du monde PHP ? 
Haxe 4 s'appr&#234;te &#224; sortir, avec son lot de nouveaut&#233;s, dont une toute nouvelle target PHP7.   Il est donc maintenant possible de coder des applications Web enti&#232;rement en Haxe en compilant le backend en PHP et le frontend en Javascript !
Nous verrons en d&#233;tail comment faire...</description><links /></event><room name="A202" /><event id="698"><persons /><person id="567">Yannick VOYEAUD</person><tags /><start>10:30</start><duration>01:00</duration><room>A202</room><slug>gedcom-une-norme-pas-si-obsolete-quon-le-dit</slug><title>GedCom une norme pas si obsol&#232;te qu'on le dit</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Le GedCom est une norme de fait. D'une tr&#232;s grande puissance elle est loin d'&#234;tre obsol&#232;te comme le pr&#233;tende certains.
Nous verrons avec le logiciel Ancestris certains aspects de cette puissance.</description><links /></event><event id="686"><persons /><person id="557">Adrien DESTUGUES</person><tags /><start>11:30</start><duration>00:30</duration><room>A202</room><slug>haiku-sur-sparc-pourquoi-comment</slug><title>Haiku sur SPARC: pourquoi, comment?</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Haiku est un syst&#232;me d'exploitation libre destin&#233; aux ordinateurs de bureau. Il est l&#233;ger et simple, sans pour autant sacrifi&#233; la flexibilit&#233; et les possibilit&#233;s d'utilisation plus avanc&#233;es.
SPARC est une architecture libre de processeurs d&#233;velopp&#233;e &#224; l'origine par Sun Microsystems.

Quand on parle de syst&#232;mes d'exploitation libres, on pense tout de suite &#224; Linux, mais ce n'est pas le seul. Pour les architectures de processeurs, il est en ce moment beaucoup question de RISC-V (encore en d&#233;veloppement) et de POWER (tout fra&#238;chement lib&#233;r&#233; par IBM), et SPARC se fait un peu oublier, sa lib&#233;ration ayant eu lieu il y a tout juste 30 ans.

Pourquoi est-ce indispensable d'avoir plusieurs syst&#232;mes et plusieurs architectures de processeurs? Quels sont les points forts de Haiku et de SPARC dans ce domaine, comment compl&#232;tent-ils l'offre des autres alternatives? Du c&#244;t&#233; technique, quelles sont les difficult&#233;s pour les faire fonctionner ensemble?</description><links /></event><event id="829"><persons /><person id="695">Cl&#233;ment AUBIN</person><tags /><start>12:00</start><duration>00:30</duration><room>A202</room><slug>hardening-a-company-secret-management-with-foss-a-</slug><title>Hardening a company secret management with FOSS - A case study</title><subtitle /><track>S&#233;curit&#233;</track><type>conference</type><language /><description>Beyond the usual security guidelines that we can find in most organizations (limiting administrative rights on computers, setting up firewalls, ...), the good management of passwords shared between employees, clients or providers is key. 

In this talk, we will go through how we managed at XWiki SAS to deploy a unique secret management strategy based on the Passbolt (https://passbolt.com) platform for our 500+ passwords, ensuring :
* The secure sharing of secrets, with traceability
* The automated, periodic renewal of those secrets</description><links /></event><event id="827"><persons /><person id="695">Cl&#233;ment AUBIN</person><tags /><start>14:30</start><duration>00:30</duration><room>A202</room><slug>building-a-customized-knowledge-base-in-minutes-2</slug><title>Building a customized knowledge base in minutes</title><subtitle /><track>Technique</track><type>conference</type><language /><description>When working in teams on a project, we often observe that people don't tend not to use very collaborative solutions for their work. Documents get scattered across multiple folders or in emails, it gets harder to distinguish an old version of a document from a new one and we miss the possibility to link documents between each others.

XWiki aims to provide a solution to this problem. Based on the concept of "wiki" : a website on which people can create pages and make links between them ; XWiki offers an actual platform that, in addition to providing every features needed for a good wiki (page history, links, hierarchy, &#8230;), allows the real creation of collaborative spaces.

This conference aims to show how XWiki can help any individual or team to build a knowledge base adapted to his needs. We will run through some of the most popular features proposed by XWiki to adapt the platform to company use cases.

The conference will be held as follows :

* Presentation of the XWiki Open Source project and the concepts behind it ;
* Demonstration of the creation of a knowledge base for a team with a specific use case ;
* Questions and answers, either on the demonstration or more broadly on the Open Source project itself.</description><links /></event><event id="697"><persons /><person id="566">Marina FERN&#193;NDEZ DE RETANA</person><tags /><start>15:00</start><duration>00:30</duration><room>A202</room><slug>frundis-et-autres-outils-libres-pour-lecrivain</slug><title>Frundis et autres outils libres pour l'&#233;crivain</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Ceci est une introduction, du point de vue d'une auteure, &#224; certains outils libres pour l'&#233;crivain, en particulier au langage de balisage s&#233;mantique Frundis. Ce langage a &#233;t&#233; sp&#233;cifiquement cr&#233;&#233; pour l'&#233;criture de romans. Proposant les balises courantes&#160;pour les chapitres, paragraphes, dialogues, tables des mati&#232;res&#8230; le langage est aussi extensible et s'adapte aux besoins de chaque projet d'&#233;criture particulier. Frundis permet de produire les formats essentiels pour l'&#233;crivain, comme Epub et PDF via LaTeX.

Nous mentionnerons des outils libres compl&#233;mentaires &#224; Frundis&#160;: un &#233;diteur de texte, un correcteur comme Grammalecte, entre autres. Nous expliquerons comment nous avons utilis&#233; l'ensemble de ces outils pour g&#233;rer confortablement le d&#233;veloppement de plusieurs &#339;uvres multilingues.</description><links /></event><event id="737"><persons /><person id="613">Ale ABDO</person><tags /><start>15:30</start><duration>00:30</duration><room>A202</room><slug>zot-aux-frontieres-des-reseaux-federes-avec-hubzil</slug><title>Zot : aux fronti&#232;res des r&#233;seaux f&#233;d&#233;r&#233;s avec Hubzilla et Zap</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Deux ann&#233;es et quelques versions majeures apr&#232;s notre derni&#232;re pr&#233;sentation au Capitole du Libre, le protocole &#171; Zot &#187; d&#233;ploy&#233; dans les plateformes Hubzilla et Zap continue &#224; pousser les fronti&#232;res de l'espace de la f&#233;d&#233;ration. On va vous introduire aux applications et aux avantages de ce protocole qui nous permet d'aller l&#224; o&#249; aucun autre r&#233;seau n'est jamais all&#233; - dont l'identit&#233; nomade, la synchronisation des clones, l'authentification et le contr&#244;le d'acc&#232;s distantes - et montrer la feuille de route vers encore plus d'autonomie et r&#233;silience pour les membres du r&#233;seau avec l'introduction prochaine du &#171; contenu nomade &#187;. Le projet a une ambiance amicale aux nouveaux membres, et a aussi besoin de d&#233;veloppeurs int&#233;ress&#233;.e.s ! Venez le d&#233;couvrir et qui sait vous aussi allez #GetZot ?</description><links /></event><room name="A203" /><event id="763"><persons /><person id="604">Aline BARDOU</person><tags /><start>10:30</start><duration>01:00</duration><room>A203</room><slug>fold-stories-le-pari-fou-dun-jeu-libre-et-commerci</slug><title>Fold Stories : le pari fou d'un jeu libre et commercial</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>Fold Stories est un jeu sous licence libre produit par OtterWays, un petit studio francais. Mais comment concilier l'esprit du Libre avec l'obligation de rentabilit&#233; ? Quelles sont les contraintes et les obstacles d'un tel choix ? Y-a-t-il des avantages &#224; choisir une licence libre plut&#244;t qu'une propri&#233;taire ? Nous tenterons de r&#233;pondre &#224; toutes ces questions au travers de notre exp&#233;rience sur Fold Stories.</description><links /></event><event id="791"><persons /><person id="609">Squeeek</person><tags /><start>11:30</start><duration>01:00</duration><room>A203</room><slug>accueil-des-oublieuses-dans-le-khanat</slug><title>Conf&#233;rence th&#233;&#226;tralis&#233;e : Accueil des Oublieuses dans le Khanat</title><subtitle /><track>Jeux Libres</track><type>conference</type><language /><description>Parlons culture libre : le Khanat est un univers ouvert et libre, cr&#233;&#233; collaborativement par nous mais aussi par qui souhaite y participer. Il a d&#233;j&#224; donn&#233; lieu &#224; diverses cr&#233;ations culturelles : textes, musiques, jeux, dessins...
Un jeu vid&#233;o est en pr&#233;paration dans cet univers, ainsi que plusieurs projets plus petits.

Nous vous proposons une pr&#233;sentation non technique de l'univers du Khanat : g&#233;ographie et astronomie, biologie et ethnologie, sciences et technologies ainsi que d'autres th&#233;matiques g&#233;n&#233;rales seront pr&#233;sent&#233;es par Squeeek, Compagnon des Brumes. Il vous encouragera &#224; r&#234;ver le Khanat avec le Khan et les autres ra.

Certains mots de vocabulaire vous sont incompr&#233;hensibles ? La conf&#233;rence sera l'occasion de d&#233;couvrir les concepts derri&#232;re ces mots et d'enrichir le Khanat tous ensemble pour en faire un r&#234;ve commun !</description><links /></event><event id="796"><persons /><person id="662">Emmanuelle HELLY / Numahell</person><person id="668">&#201;lise GHIENNE</person><tags /><start>14:00</start><duration>01:00</duration><room>A203</room><slug>le-libre-et-less-economie-sociale-et-solidaire-peu</slug><title>Le Libre et l'ESS peuvent-ils faire bon m&#233;nage?</title><subtitle /><track /><type>conference</type><language /><description>Le Libre et l'ESS (&#201;conomie Sociale et Solidaire) partagent de nombreux aspects, en particulier la th&#233;orie des communs, et pourtant les deux courants peinent &#224; faire converger leurs forces.

Petit tour d'horizon pour voir, ensemble, comment on pourrait am&#233;liorer le monde de l'ESS gr&#226;ce au Libre, et am&#233;liorer le monde du Libre gr&#226;ce &#224; l'ESS.</description><links><link tag="slides">https://media.ponyconf.io/cdl-2019/le-libre-et-less-economie-sociale-et-solidaire-peu/Libre-et-ESS.pdf</link></links></event><room name="A301" /><event id="899"><persons /><person id="620">Fabien BENETOU</person><tags /><start>10:30</start><duration>02:00</duration><room>A301</room><slug>webar-hackathon-using-geospatial-dataset-with-au-4</slug><title>WebAR hackathon, using geospatial dataset with augmented reality on the web</title><subtitle /><track /><type>atelier</type><language /><description>WebAR hackathon, using geospatial dataset with augmented reality on the web</description><links /></event><event id="900"><persons /><person id="620">Fabien BENETOU</person><tags /><start>14:00</start><duration>02:00</duration><room>A301</room><slug>webar-hackathon-using-geospatial-dataset-with-au-5</slug><title>WebAR hackathon, using geospatial dataset with augmented reality on the web</title><subtitle /><track /><type>atelier</type><language /><description>WebAR hackathon, using geospatial dataset with augmented reality on the web</description><links /></event><room name="A302" /><event id="714"><persons /><person id="582">Pierre-Jean TEXIER</person><person id="756">Joris Offouga</person><tags /><start>10:30</start><duration>01:00</duration><room>A302</room><slug>mender-20-101-bien-demarrer-avec-les-update-module</slug><title>Mender 2.0 101: Bien d&#233;marrer avec les 'update modules'</title><subtitle /><track>IoT et Embarqu&#233;</track><type>conference</type><language /><description>Sortie courant 2019 (https://mender.io/blog/mender-2-0-released-application-updates),
la version 2.0 de Mender introduit de nouvelles fonctionnalit&#233;s afin d&#8217;&#233;tendre
les sc&#233;narios de mises &#224; jour au niveau application en environnement Linux Embarqu&#233;.

Initialement construit sur un sch&#233;ma &#224; double partition (A/B) dans sa version 1.X, la nouvelle
mouture de Mender permet par exemple&#160;:

- Mise &#224; jour de container (e.g Docker)
- Mise &#224; jour logiciel FPGA et/ou microcontr&#244;leur
- Mise &#224; jour d&#8217;une arborescence donn&#233;e du syst&#232;me de fichier racine
- et bien d&#8217;autres encore

Ainsi, au travers diff&#233;rentes d&#233;monstrations sur cibles industrielles de type NXP i.MX8
et ST32MP1, nous verrons comment tirer pleinement parti des 'update modules', le tout articul&#233; autour du projet Yocto et Buildroot.</description><links /></event><event id="721"><persons /><person id="593">Neil</person><person id="594">Brume</person><tags /><start>11:30</start><duration>01:00</duration><room>A302</room><slug>un-chatons-etudiant-a-lecole-42</slug><title>Un CHATONS &#233;tudiant &#224; l'&#233;cole 42</title><subtitle /><track /><type>conference</type><language /><description>En tant qu'&#233;tudiant&#183;e&#183;s &#224; l'&#233;cole 42, nous avons cr&#233;&#233; l'association 42l (42l.fr) qui a pour objectif de sensibiliser nos camarades aux enjeux &#233;thiques et sociaux port&#233;s par le mouvement du logiciel libre.

Nous vous d&#233;crirons l'environnement dans lequel notre association &#233;volue, les difficult&#233;s auxquelles nous faisons face, les actions concr&#232;tes que nous avons men&#233; jusque l&#224; et ce que nous pr&#233;voyons dans le cadre de notre campagne de sensibilisation pour l'ann&#233;e &#224; venir.</description><links /></event><event id="840"><persons /><person id="595">Tracim</person><person id="597">Damien ACCORSI</person><tags /><start>14:00</start><duration>01:00</duration><room>A302</room><slug>collaboration-pour-tous-decouvrez-les-cas-dutilisa</slug><title>Collaboration pour tous : d&#233;couvrez les cas d'utilisation de tracim</title><subtitle /><track /><type>conference</type><language /><description>A l'heure des "digitalworkplace" les solutions collaboratives sont l&#233;gions, propri&#233;taires pour la plupart. Si l'on mixe cela avec la mode du SAAS (software as a service - logiciel commercialis&#233; sous forme de service), on se retrouve rapidement avec des donn&#233;es &#233;parpill&#233;es &#224; travers le monde, un compte sur chaque plateforme, une connaissance et m&#233;moire commune &#233;parpill&#233;e, des donn&#233;es personnelles et confidentielles exploit&#233;es.

Pourtant une alternative simple d'utilisation et de qualit&#233; professionnelle existe, et en plus elle est libre : Tracim.

Durant cette conf&#233;rence nous vous pr&#233;senterons les probl&#233;matiques adress&#233;es par tracim &#224; travers une s&#233;rie de cas d'utilisation professionnelle, associative, individuelle. Nous parlerons &#233;galement des outils compl&#233;mentaires n&#233;cessaires le cas &#233;ch&#233;ant &#224; une collaboration efficace, libre et souveraine.</description><links /></event><event id="789"><persons /><person id="654">Andr&#233; HOARAU</person><tags /><start>15:00</start><duration>00:30</duration><room>A302</room><slug>qrop-la-planification-libre-pour-le-maraichage</slug><title>Qrop : la planification libre pour le mara&#238;chage</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Qrop est un logiciel libre de planification et de suivi des cultures en mara&#238;chage. Il a &#233;t&#233; con&#231;u par et pour des paysan&#8901;nes au sein de L'Atelier paysan. Cette coop&#233;rative d'autoconstruction, qui diffuse depuis 10 ans des outils libres pour l'agriculture biologique, r&#233;alise ainsi son premier logiciel &#171; autoconstruit &#187; avec Qt, C++ et QML.

La conf&#233;rence pr&#233;sentera le logiciel, l'historique du projet, les difficult&#233;s rencontr&#233;es et les perspectives de d&#233;veloppement.</description><links /></event><room name="B00" /><event id="904"><persons /><person id="718">Christian MOMON</person><tags /><start>10:30</start><duration>01:00</duration><room>B00</room><slug>le-chaton-chapril-recrute</slug><title>Le CHATON Chapril recrute</title><subtitle /><track>Technique</track><type>conference</type><language /><description>Chapril est le CHATON de l'April. Ouvert depuis novembre 2018, c'est une infrastructure compl&#232;te pour h&#233;berger des services libres dans le cadre du collectif CHATONS.
Venez d&#233;couvrir notre fonctionnement et nos besoins : animateur de service, adminsys d&#233;butant ou confirm&#233;, mod&#233;rateurs, chef de projet&#8230;
https://www.chapril.org</description><links /></event><event id="896"><persons /><person id="761">Gr&#233;gory Colpart</person><tags /><start>11:30</start><duration>01:00</duration><room>B00</room><slug>ceph-le-stockage-du-futur</slug><title>Ceph, le stockage du futur</title><subtitle /><track>DevOps</track><type>conference</type><language /><description>Ceph est une plateforme libre de stockage distribu&#233;. Ceph permet de stocker des objets r&#233;partis sur plusieurs n&#339;uds de fa&#231;on redondante.
Cela permet de multiples cas d'usage : archiver de grand volume de donn&#233;es (Po), partager des fichiers entre serveurs&#8230; mais surtout cela devient un outil de base des solutions libres de virtualisation/conteneurisation (KVM, Proxmox, OpenStack, Kubernetes&#8230;) et des solutions de &#171; Cloud Storage &#187; chez DigitalOcean, OVH, etc.
Comment fonctionne Ceph en interne ? Revenons sur les m&#233;canismes de base de la technologie : OSD, PG, monitor, etc. Comment utiliser Ceph concr&#232;tement ? Parlons de l'installation et l'utilisation en mode bloc (rdb) ou en mode filesystem (CephFS).</description><links /></event><event id="735"><persons /><person id="570">Framasoft (Pouhiou)</person><tags /><start>14:00</start><duration>01:00</duration><room>B00</room><slug>chatons-on-en-est-ou</slug><title>CHATONS, on en est o&#249; ?</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Le Collectif des H&#233;bergeurs Alternatifs, Transparents, Ouverts, Neutres et Solidaires (CHATONS) a vu le jour fin 2016 sous l'impulsion de l'association Framasoft. Cette conf&#233;rence se propose de se rem&#233;morer les enjeux auxquels souhaitait r&#233;pondre le collectif, de voir le chemin accompli sur les trois derni&#232;res ann&#233;es et de se questionner sur son avenir. Un exercice d'&#233;tat des lieux en mode pass&#233; / pr&#233;sent / futur. On y parlera donc de sa composition, de sa gouvernance, de la vari&#233;t&#233; des services propos&#233;s, des relations aux utilisateur&#8901;ices, de solidarit&#233; et bien s&#251;r de matous, minous et autres f&#233;lins...</description><links /></event><event id="743"><persons /><person id="619">hellosct1</person><tags /><start>15:00</start><duration>01:00</duration><room>B00</room><slug>controler-vos-donnees-dans-le-web</slug><title>Contr&#244;ler vos donn&#233;es dans le Web</title><subtitle /><track>Web</track><type>conference</type><language /><description>Firefox est le &#171; seul &#187; navigateur web d&#233;velopp&#233; et maintenu par une fondation &#224; but non lucratif. Celle-ci est soucieuse de tous les internautes et pas seulement de ses utilisateurs et utilisatrices. Il existe cependant d&#8217;autres solutions compl&#233;mentaires pour vous assurer de vos donn&#233;es aussi bien pour la navigation au quotidien, que dans un projet professionnel.

Cette session s&#8217;int&#233;ressera &#224; la navigation, la s&#233;curit&#233; de vos identifiants et mots de passe, le cloisonnement des donn&#233;es, le transfert de fichiers chiffr&#233;s aussi bien avec un ordinateur de bureau, que sur mobile.</description><links /></event><event id="886"><persons /><person id="554">Capitole du Libre</person><tags /><start>16:00</start><duration>00:30</duration><room>B00</room><slug>conference-de-cloture-2</slug><title>Conf&#233;rence de cloture</title><subtitle /><track /><type>keynote</type><language /><description>Petit r&#233;cap du Capitole du Libre 2019</description><links /></event><room name="B006-B007" /><room name="B104" /><event id="889"><persons /><person id="554">Capitole du Libre</person><tags /><start>10:30</start><duration>02:00</duration><room>B104</room><slug>atelier-installation-depannage-linux-14</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><event id="890"><persons /><person id="554">Capitole du Libre</person><tags /><start>14:00</start><duration>02:00</duration><room>B104</room><slug>atelier-installation-depannage-linux-15</slug><title>Atelier installation &amp; d&#233;pannage Linux</title><subtitle /><track /><type>atelier</type><language /><description>Atelier installation &amp; d&#233;pannage Linux</description><links /></event><room name="B207" /><event id="891"><persons /><person id="746">David Charbonnier</person><tags /><start>10:30</start><duration>02:00</duration><room>B207</room><slug>decouvrir-la-service-mesh-avec-linkerd2</slug><title>D&#233;couvrir la Service Mesh avec Linkerd2</title><subtitle /><track /><type>atelier</type><language /><description>Dans les environnements cloud native (comprendre pens&#233;s &#224; l'&#232;re du Cloud), les applications deviennent de plus en plus complexes et les paradigmes d'architecture ont &#233;volu&#233; vers les microservices. Plusieurs probl&#232;mes se posent alors:

 - Comment avoir une vision claire et simple sur le fonctionnement de notre application, le monitoring classique n'&#233;tant plus adapt&#233; &#224; ces environnements hautement volatiles?
 - De plus, comment s&#233;curiser les communications r&#233;seau au sein de l'applicatif, faire porter cette responsabilit&#233; par l'applicatif alourdissant le code et complexifiant le travail des d&#233;veloppeurs?
 - D'autre part, comment g&#233;rer les &#233;volutions et mont&#233;es en version de ces applications, les m&#233;canismes classiques disponibles sur Kubernetes r&#233;pondant &#224; certains besoins mais pas &#224; tous?

C'est ici que la Service Mesh intervient et nous allons d&#233;couvrir ensemble comment installer Linkerd2 sur un cluster Kubernetes et comment l'utiliser afin de gagner en observabilit&#233;, en s&#233;curit&#233; et en souplesse dans la gestion d'une application construite autour d'une architecture microservices.

Dans cet atelier, nous ferons une petite introduction &#224; Kubernetes avant de d&#233;ployer notre propre cluster. Nous introduirons ensuite la Service Mesh ainsi que Linkerd2 plus en d&#233;tails que nous d&#233;ploieront dans notre cluster Kubernetes. Enfin, nous utiliserons le Service Mesh pour g&#233;rer une application de d&#233;monstration.

Pr&#233;requis: 
 - disposer d'un poste avec un client SSH et un navigateur ainsi qu'une connection Internet
 - &#234;tre &#224; l'aise avec la ligne de commande Linux
 - &#234;tre &#224; l'aise avec les conteneurs
 - avoir une premi&#232;re exp&#233;rience sur Kubernetes est un vrai plus</description><links /></event><event id="901"><persons /><person id="766">Stanislas Dolcini</person><tags /><start>14:00</start><duration>02:00</duration><room>B207</room><slug>venez-jouer-a-0-ad-un-rts-dans-le-monde-antique-2</slug><title>Venez jouer &#224; 0 A.D., un RTS dans le monde antique !</title><subtitle /><track>3D</track><type>atelier</type><language /><description>Venez d&#233;couvrir 0 A.D. au cours d'un atelier o&#249; nous installerons ensemble le jeu et jouerons quelques parties ! Amenez vos ordinateurs portables pour profiter au maximum de cet atelier ; pour celles et ceux n'ayant pas le leur, les parties que nous ferons seront tout de m&#234;me vid&#233;o-projet&#233;es.</description><links /></event><room name="B208" /><event id="893"><persons /><person id="747">Adrien Blind</person><person id="770">Ludovic Piot</person><person id="771">Laurent Grangeau</person><tags /><start>10:30</start><duration>02:00</duration><room>B208</room><slug>atelier-en-cours-de-definition</slug><title>Introduction au CI/CD avec Gitlab CI &amp; Kubernetes</title><subtitle /><track /><type>atelier</type><language /><description>Durant cette session, vous d&#233;couvrirez tout d'abord comment construire une plateforme d'industrialisation du delivery logicielle en utilisant Gitlab CI ; celui-ci sera d&#233;ploy&#233; pour l'occasion sur un cluster Kubernetes. Dans un second temps, l'exercice consistera &#224; utiliser cette m&#234;me plateforme pour d&#233;ployer de fa&#231;on continue une application sur ce m&#234;me cluster Kubernetes.</description><links /></event><event id="712"><persons /><person id="579">Axel VIALA</person><tags /><start>14:00</start><duration>02:00</duration><room>B208</room><slug>initiation-au-langage-rust</slug><title>Initiation au langage Rust</title><subtitle /><track>Technique</track><type>atelier</type><language /><description>D&#233;couvrir Rust par la pratique en abordant les points essentiels du langage dans une ambiance studieuse mais d&#233;contract&#233; ou poser des questions et s'entraider est la bienvenue.</description><links /></event><room name="B306" /><event id="848"><persons /><person id="712">Mathias FONTMARTY</person><tags /><start>10:30</start><duration>02:00</duration><room>B306</room><slug>dessin-illustration-avec-krita</slug><title>Dessin &amp; Illustration avec Krita</title><subtitle /><track>3D</track><type>atelier</type><language /><description>Dans cet atelier, nous verrons les diff&#233;rentes &#233;tapes pour cr&#233;er une illustration avec Krita, de l'esquisse jusqu'au rendu final.

Nous aborderons &#224; la fois
- les aspects techniques/logiciels: calques, brosses, s&#233;lection, filtres, ...
- l'approche plus globale/th&#233;orique: maquettes, esquisse, composition, lisibilit&#233;, &#233;quilibre...

Afin de profiter au maximum de cet atelier, une tablette graphique est fortement recommand&#233;e !</description><links /></event><event id="877"><persons /><person id="742">Simone FERRECCHIA</person><tags /><start>14:00</start><duration>02:00</duration><room>B306</room><slug>tbd</slug><title>Cr&#233;ation num&#233;rique</title><subtitle /><track /><type>atelier</type><language /><description>Viens cr&#233;er tes propres &#339;uvres d'arts &#224; l'aide de machines &#224; commandes num&#233;rique. Possibilit&#233; d'utiliser un plotter vertical (un dispositif pouvant transf&#233;rer un dessin num&#233;rique sur une surface verticale), des imprimantes 3D, un eggbot (un dispositif qui transf&#232;re tes dessins num&#233;riques sur des objets sph&#233;riques).

Pour les plus petits: programmation visuelle et prototypage &#233;lectronique avec des snap circuits, peinture conductive, puzzles en 3 dimensions.</description><links /></event><room name="B307" /><event id="851"><persons /><person id="713">Maiwann</person><tags /><start>10:30</start><duration>02:00</duration><room>B307</room><slug>smartphone-vs-les-forces-du-mal</slug><title>Smartphone VS Les forces du mal</title><subtitle /><track /><type>atelier</type><language /><description>Votre t&#233;l&#233;phone est un smartphone (sous Android) et vous aimeriez mieux comprendre ce qu'il dit de vous et comment faire pour qu'il soit plus respectueux de votre vie priv&#233;e ? Nous discuterons ensemble d'astuces accessibles aux d&#233;butant&#183;es pour en savoir plus sur le sujet et &#233;viter que votre t&#233;l&#233;phone soit trop bavard !</description><links /></event><event id="736"><persons /><person id="612">hocine</person><person id="748">orgon</person><tags /><start>14:00</start><duration>02:00</duration><room>B307</room><slug>table-accessibilite-et-projet-s2s</slug><title>table accessibilit&#233; et projet S2S</title><subtitle /><track /><type>atelier</type><language /><description>Un projet libre et gratuit, profitez-en, la promo est limit&#233;e dans le temps (apr&#232;s expiration, ce projet sera libre et gratuit).

Le projet s2s vise &#224; rassembler les vid&#233;os en Langue des Signes Fran&#231;aise ou en VSM sur une m&#234;me instance PeerTube. Un exemple vaut mieux qu'un long discours : https://peertube.s2s.video/videos/watch/b0176c09-b5b6-44d3-8a3f-0ff671608041</description><links /></event><room name="B308" /><event id="691"><persons /><person id="561">Thibaud ARTIGUES</person><tags /><start>10:30</start><duration>02:00</duration><room>B308</room><slug>speedmodeling-avec-blender-28</slug><title>Speedmodeling avec Blender 2.8</title><subtitle /><track>3D</track><type>atelier</type><language /><description>L'objectif de l'atelier est de pouvoir mod&#233;liser tr&#232;s rapidement afin d'optimiser le processus de cr&#233;ation. Avec l'aide de plugin et de personalisation de l'interface ainsi qu'un moteur de rendu professionel, Blender n'a plus grand chose &#224; envier aux grands noms. Ses atouts font qu'il devient l'outil de r&#233;f&#233;rence pour les studios de jeux vid&#233;os comme ubisoft.

Il n'est pas n&#233;cessaire d'avoir d&#233;j&#224; utilis&#233; Blender mais la compr&#233;hension des outils de mod&#233;lisation est un plus afin d'aller rapidement au coeur du sujet : le prototypage rapide.

Nous verrons l'interface, son optimisation, les raccourcis et les differents outils / plugins &#224; maitriser afin d'&#234;tre op&#233;rationel.</description><links /></event><event id="790"><persons /><person id="609">Squeeek</person><person id="674">Lyne</person><tags /><start>14:00</start><duration>02:00</duration><room>B308</room><slug>khanathon-special-krili</slug><title>Khanathon sp&#233;cial Krili</title><subtitle /><track>Jeux Libres</track><type>atelier</type><language /><description>Dans l'univers libre (CC-BY-SA) du Khanat, une bonne partie des objets technologiques s'appuie sur les krili, des cristaux color&#233;s qui ont certains effets lorsqu'ils sont apair&#233;s de fa&#231;on ad&#233;quate. Qu'il s'agisse d'une charette &#224; bras &#224; l&#233;vitation - c'est plus pratique que les roues - ou d'un module de m&#233;moire pour des enregistrements vid&#233;os, ou encore d'une arme &#224; &#233;nergie puls&#233;e, la base, c'est le krili ! Ces cristaux croissent &#224; partir des cocons de certains insectes.

Vous avez envie d'en savoir plus ? Nous aussi. Nous avons donc besoin de nous entraider en mode atelier participatif pour inventer plus pr&#233;cis&#233;ment comment tout &#231;a s'articule et &#224; quoi &#231;a ressemble. Si vous avez envie d'inventer avec nous les explications &#224; tout &#231;a, si vous voulez venir dessiner ou sculpter des insectes, cocons ou cristaux, venez r&#234;ver un morceau du Khanat avec nous !</description><links /></event><room name="C002" /><event id="836"><persons /><person id="703">Kovann Ly</person><tags /><start>11:00</start><duration>00:30</duration><room>C002</room><slug>le-logiciel-libre-au-service-de-leducation-en-guin</slug><title>Le logiciel libre au service de l'&#233;ducation en Guin&#233;e</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Retour d'exp&#233;rience de l'utilisation du libre par l'association EDA (HTTPS://eda.ong)

Nous d&#233;ployons des centres informatiques pour donner acc&#232;s a de la formation a l'informatique aux &#233;l&#232;ves et aux enseignants.

Nous avons bases notre projet sur des raspberry pi et des logiciels libres exclusivement. Nous sommes convaincus que le libre est la meilleure fa&#231;on de donner acc&#232;s a un maximum de ressources et de capacit&#233;s.

Nous avons actuellement 5 centres informatiques depuis 2017 en production et 12 autres en projet.

La conf&#233;rence expliquera :


Les avantages de l'utilisation du libre
Les avantages du raspberry pi
L'utilisation des logiciels Ludo &#233;ducatifs libres</description><links /></event><event id="822"><persons /><person id="692">Afrikalan / association Bilou Toguna</person><tags /><start>14:00</start><duration>01:00</duration><room>C002</room><slug>afrikalan-des-pinguoins-sur-les-bancs-des-ecoles-m</slug><title>Afrikalan: des pinguoins sur les bancs des &#233;coles Maliennes.</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>Dans un contexte de grande difficult&#233; (&#233;coles surcharg&#233;es, &#233;chec scolaire et analphab&#233;tisme &#233;lev&#233;s), les logiciels libres &#233;ducatifs peuvent apporter un soutient aux enfants en renfor&#231;ant les apprentissages faits &#224; l'&#233;cole. A condition toutefois de tenir compte de certaines probl&#233;matiques: &#233;lectricit&#233; et internet pas toujours disponibles, ordinateurs et p&#233;dagogie num&#233;rique peu d&#233;mocratis&#233;s, etc...

Afrikalan fait partie des projets qui tentent d'apporter des solutions adapt&#233;es &#224; ce terrain, en construisant de petits ordinateurs &#233;ducatifs donn&#233;s &#224; diff&#233;rents lieux accueillant les enfants&#160;: biblioth&#232;ques scolaires, centres d'animation culturelle, centres d'accueil... Ils donnent acc&#232;s, sans connexion internet et via une interface simple &#224; diff&#233;rents jeux &#233;ducatif, encyclop&#233;dies, etc...

En partant de cette exp&#233;rience, on abordera les questions auxquelles on peut faire face lorsqu'on diffuse des outils de p&#233;dagogie num&#233;rique dans un tel contexte, et quelques pistes envisag&#233;es. 

L'utilisation des logiciels libres est un atout consid&#233;rable&#160;: En plus de permettre une diffusion sans restriction du contenu &#233;ducatif, ils permettent de l'adapter au mieux au public qui va l'utiliser. Cela permet de garantir de meilleures chances de r&#233;ussite, que de simplement &#171;&#160;copier-coller&#160;&#187; quelque chose qui a &#233;t&#233; cr&#233;&#233; pour un contexte totalement diff&#233;rent.</description><links /></event><event id="761"><persons /><person id="633">Yann KERVRAN</person><tags /><start>15:00</start><duration>01:00</duration><room>C002</room><slug>le-poete-commoniste-dans-la-cite-numerique</slug><title>Le po&#232;te commoniste dans la cit&#233; num&#233;rique</title><subtitle /><track>Le Libre</track><type>conference</type><language /><description>&#192; travers mon exp&#233;rience d&#8217;&#233;crivain partisan des communs et du logiciel libre, j&#8217;aimerais &#233;voquer le r&#244;le des cr&#233;atifs culturels dans la soci&#233;t&#233;, leur utilit&#233;, leurs possibilit&#233;s et leurs responsabilit&#233;s. Il s&#8217;agit du partage en l&#8217;&#233;tat d&#8217;une r&#233;flexion permanente sur mon travail, mes outils et mes aspirations, dans ma production litt&#233;raire et au sein de Framabook, la maison d&#8217;&#233;dition de Framasoft.</description><links /></event><room name="Foyer des &#201;tudiants" /><event id="885"><persons /><person id="554">Capitole du Libre</person><tags /><start>12:30</start><duration>01:30</duration><room>Foyer des &#201;tudiants</room><slug>pause-dejeuner-6</slug><title>Pause d&#233;jeuner</title><subtitle /><track /><type>keynote</type><language /><description>Pause d&#233;jeuner</description><links /></event></day></schedule>